[
  {
    "title": "I moved in today, and this is my experience",
    "selftext": "Hey r/Purdue! I figured with people moving in soon, there might be a lot of anxiety surrounding moving in and what it's like. I'm moved in a bit earlier than most, and here's how my day went.\n\nWhen I arrived on campus, I wasn't able to go directly to my residence hall. I first had to stop at McCutcheon parking garage for a health check. While there, they took my temperature, glanced over my PUID, wrote down where I was going, and asked to see the email confirming my COVID test results. they also checked the temperatures of my companions helping me move in. After I was given the all clear, they handed me a token (I won't say what it was so people don't replicate it) and I was on my way.\n\nI arrived at my residence hall, and went to the front desk to check in. In order to check in, I had to provide both my PUID and the token I received at the health checkpoint. They gave me my keys and Protect Purdue kit, and I was on my way to my room. No furniture was in any weird positions or anything, but my room had been de-densified (meaning I am the only resident for this fall semester, at least). The kits are well put together and included some extra gifts that weren't listed before, such as pain-reliever and extra wipes. Beware of the masks, however, as they're on the smaller side. I loaded my things into my room, went shopping, came back, and my companions were on their way.\n\nAfter that, I decided to go and grab dinner. I believe the only dining hall open was Earhart, so that's where I went for dinner. Upon entering they scanned my PUID, and sent me through a labyrinth of tables that were meant to separate students if a line were to form. Additionally, there's signage showing where to stand to maintain 6 ft distance as well as what direction you need to be heading. My first stop was a table that had the displays of what was for dinner. I chose chicken sliders plus sides and whatever. They then had a sign that asked that I put my phone away and sanitize my hands. The next table had cups, bags, straws, silverware, salt, and pepper that I could grab for my meal. I put these in my bag, and headed to the next station. Here I was able to fill my cup with my drink of choice (I had blue powerade, a classic), and I moved on. I then arrived at the actual serving counter, where two staff members greeted me. They asked how many sliders I wanted, what toppings I wanted, what sides I wanted, etc. They then passed my dinner tray to the next person who closed it up, asked if I wanted any dessert, and sent me on my way. There were specific stickers showing which way to exit.\n\nI then caught up with a friend I saw also getting dinner, and we headed for one of the dining tents. This one was located in the middle of the street between Harrison and First Street Suites. Eating in the dining thing was kinda weird, but you get used to it. It wasn't that hard to hear my friend, but the dining tent wasn't very crowded. Actually, scratch that. There may have been about 10 people there, max.\n\nFinally, to end my first day back on campus I headed back to my residence hall. I'm new to this hall I'm living in, so I decided to poke around at the social areas. The social distancing guidelines were pretty straightforward imo. Tables and couches were spaced out quite a bit, certain game tables were closed off, and any smallish meeting room had a maximum occupancy listed on the door.\n\nSo that's my experience! Please comment any questions you have, and I'll get back to them as best I can. Boiler Up :)\n\nEdit: Grammar, de-densification clarification",
    "id": "i6bmzr",
    "comments": [
      {
        "id": "g0urvq0",
        "content": "Blue Powerade Gang",
        "replies": [
          {
            "id": "g0utuve",
            "content": "Blue Powerade is superior",
            "replies": []
          }
        ]
      },
      {
        "id": "g0ur6bm",
        "content": "Thanks for sharing! :)",
        "replies": []
      },
      {
        "id": "g0uxkwu",
        "content": "Thanks for the story! Food situation sounds a lot better than what I expected. Glad they are giving us options",
        "replies": [
          {
            "id": "g0uxrsu",
            "content": "Same here! I was expecting like, two options for every meal. When I went through the line for my station, they actually had multiple options too. Although I get the chicken sliders, they also has salad, mixed veggies, reubens, fries, and then like three desserts to choose from. Hopefully they keep up with this!",
            "replies": [
              {
                "id": "g0uy7p7",
                "content": "Yes me too! And asking us how much we want!",
                "replies": []
              },
              {
                "id": "g0vue7m",
                "content": "I assume I can’t get say, chicken sliders and a salad?",
                "replies": [
                  {
                    "id": "g0w03t1",
                    "content": "Actually, you can. But the same station has to be offering it. And in my case, they were!",
                    "replies": [
                      {
                        "id": "g0y5ob5",
                        "content": "That was a prepared salad though, not the salad bar like normal? What did it consist of?",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "g0uyzex",
        "content": "What kind of pain killers - morphine ?  Clorox ?  sanitizer ?  Gummy Bears ?",
        "replies": [
          {
            "id": "g0uzbtz",
            "content": "Fair question. They're called Medique APAP, it's a Non-Aspirin pain reliever and fever reducer.",
            "replies": [
              {
                "id": "g0vd5z3",
                "content": "I was at Purdue on a study abroad in the spring. I’m absolutely baffled that paracetamol (what we call Medique APAP) isn’t a common pain reliever in the US while it’s the most common in my country. I’m pleased it’s coming in the pack because man it’s a life saver when you’ve got a fever/headache/etc. Keep your heads up, looks like you’re in good hands!",
                "replies": [
                  {
                    "id": "g0vh7e4",
                    "content": "In the US paracetamol is called acetaminophen or Tylenol. It's super common here as well under those names.",
                    "replies": [
                      {
                        "id": "g0wz07o",
                        "content": "Where were you when I had a headache?",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "g0vhvz8",
            "content": "There’s no way they’re passing out morphine lmao",
            "replies": []
          }
        ]
      },
      {
        "id": "g0wa5lg",
        "content": "It was really nice of you to post this for students who are anxious about the process. I love seeing Purdue students looking out for each other. Boiler Up!",
        "replies": []
      },
      {
        "id": "g0us554",
        "content": "Can you clarify how the room was de-densified?",
        "replies": [
          {
            "id": "g0uttiw",
            "content": "There's only one person staying in my room for this year instead of two. Nothing else was changed",
            "replies": [
              {
                "id": "g0v72qo",
                "content": "Oh man you lucked out",
                "replies": [
                  {
                    "id": "g0wnrl0",
                    "content": "Is this implying there are some rooms with the pre-COVID 'two adults in a closet' situation? fuck",
                    "replies": [
                      {
                        "id": "g0wumyq",
                        "content": "Sort of. I believe all the true closet rooms (under 10 ft width) were converted. Even an inch more and it'll be a double. Basically guaranteed to get it if your roommate has it. Hopefully that'll create some peer pressure to not be a moron.",
                        "replies": []
                      }
                    ]
                  }
                ]
              },
              {
                "id": "g0v0gl0",
                "content": "So were there two desks/beds/dressers?",
                "replies": [
                  {
                    "id": "g0v18jx",
                    "content": "Yes! They are all still in the room",
                    "replies": [
                      {
                        "id": "g0v3m5y",
                        "content": "Nice, you can buy some cheap sheets and a mattress topper and turn the second bed into a couch",
                        "replies": [
                          {
                            "id": "g0xgotr",
                            "content": "My roommate moved out second semester of my freshman year, and they never moved a new person in. You know I pushed those two beds together and had a queen size for a semester.",
                            "replies": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "g0uyv5f",
        "content": "Thanks. I'm in quarantine right now and will move in a week. Your info is greatly appreciated!",
        "replies": []
      },
      {
        "id": "g0usstb",
        "content": "How’s the plastic situation in dining? Sustainable for the year?",
        "replies": [
          {
            "id": "g0utxke",
            "content": "Nothing has been changed yet. I believe Dining and Catering was aiming for a change by the beginning of the fall semester? But we'll see. For now, they're using the same Styrofoam trays.",
            "replies": [
              {
                "id": "g0wool0",
                "content": "They’re not going to be able to find enough styrofoam and plastic silverware if the dining halls have to use those all year. And why have all the tents and stuff if it’s just disposable stuff? Just send everyone to their dorm room...",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "g0v1aay",
        "content": "Thanks for this info! Did you get your PUID at check-in?",
        "replies": [
          {
            "id": "g0v1dc7",
            "content": "I actually have my PUID from last year since this is my second year at Purdue. I'm not sure how freshman go about getting their PUID, which usually happens at STAR",
            "replies": [
              {
                "id": "g0v1f4u",
                "content": "Okay, thanks. I'll just play it by ear then lol",
                "replies": [
                  {
                    "id": "g0whkew",
                    "content": "If you submitted a photo before the end of last week, your card should be waiting for you at checkin.",
                    "replies": [
                      {
                        "id": "g0wmqbo",
                        "content": "Sweet thanks fam",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "g0v7d50",
            "content": "[deleted]",
            "replies": [
              {
                "id": "g0v8p2o",
                "content": "Sorry for the confusion, I meant the ID card itself. I know my number already. Probably should've made that more clear lol",
                "replies": [
                  {
                    "id": "g0vtt9g",
                    "content": "You will get it during BGR week as far as I know",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "g0v257y",
        "content": "hey wait a second,,,,, i know you 😳😎",
        "replies": []
      },
      {
        "id": "g0v60c3",
        "content": "Is there an upper limit to the \"how much do you want\" question for dining?",
        "replies": [
          {
            "id": "g0v7s7m",
            "content": "There isn't really a question, you basically go up to the station and say \"food please\" and they give it to you. It's already portioned and they just give it to you in a  styrafoam or plastic container. They dining courts are designed to keep people moving as fast as possible so there is no negotiating how much food you get. That being said when I got stir fry from Earhart it was quite a sizeable portion and my lemon cake was quite large as well",
            "replies": [
              {
                "id": "g0wifrv",
                "content": "This. There really isn't much question as to how much you want, it's more about what you want. I will say though when it came to the sliders they did ask how many I wanted, so there might be some variance. But don't plan on getting 45 packs of cookies or something ridiculous like that.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "g0wfoeg",
        "content": "Thanks for the info! How many people helped you move in?",
        "replies": [
          {
            "id": "g0wfz0e",
            "content": "No problem! I had two companions help me move in",
            "replies": []
          }
        ]
      },
      {
        "id": "g0vtsgo",
        "content": "Did they look at your move in slot when you went through the McCutcheon parking garage or at your dorm?",
        "replies": [
          {
            "id": "g0w0gh6",
            "content": "So because of the nature of my move in time, I actually just had to be here any time on the 8th between 9 am and 6 pm. They had my folder pulled at the front desk of my hall knowing I was arriving today. Im sure the regular move in process will be a bit stricter with that.",
            "replies": []
          }
        ]
      },
      {
        "id": "g0wnnii",
        "content": "&gt;They asked how many sliders I wanted, what toppings I wanted, what sides I wanted, etc.\n\nI was so socially awkward for my first few years at Purdue that the self serve buffet was a lifesaver 😓",
        "replies": [
          {
            "id": "g0wp8tt",
            "content": "That's totally understandable. There's also days where I just don't want to talk to people, or want to keep my earbuds in. On the bright side, the dining hall staff has been nothing but super sweet as of right now (I've had 3 meals so far).",
            "replies": []
          }
        ]
      },
      {
        "id": "g0xk2n1",
        "content": "I can't imagine these dining tents lasting all that long, especially if it gets cold quicker.",
        "replies": []
      },
      {
        "id": "g0v2666",
        "content": "Was there anyone at your residence that watched you /helped you move in? Did your companions need a token or anything to allow them to help you move in? (I will be driving separate from my person helping me move in)",
        "replies": [
          {
            "id": "g0v2gl8",
            "content": "I was in the same situation with the companion driving separately. Go through the health checkpoint with them directly behind you and just tell the attendant that they're your companion. They will not need a separate token, that's just so you can get your keys. Nobody actually watched us move in, but today is probably not the experience that a majority of students will get. The only thing your companion actually needs is the temp check",
            "replies": []
          }
        ]
      },
      {
        "id": "g0v5jom",
        "content": "they used to have made to order pasta at Earhart. it was in the back on the right side. you can make some really creative concoctions there. highly recommend if avaialble. also the made to order stir fry is amazing.",
        "replies": [
          {
            "id": "g0viodo",
            "content": "None of the made to order stuff are available rn",
            "replies": [
              {
                "id": "g0vmyo5",
                "content": "thats a shame. best part about Earhart.",
                "replies": []
              }
            ]
          },
          {
            "id": "g0w4xa4",
            "content": "Man I know some people hate on the quality of the food in the dining halls but I really miss the convenience of those made to order stations. I got a burrito bowl from Windsor like every other day for lunch, it was amazing.",
            "replies": [
              {
                "id": "g0wo01c",
                "content": "windsor burritos and earhart stir fry are just high octane, incredible comfort food nostalgia\n\nsuch a shame they destroyed dining now lol",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "g0wpnru",
        "content": "Does anyone know where/when you get your kit if youre living off campus?",
        "replies": [
          {
            "id": "g0wpr4l",
            "content": "Great question! I'm not sure, but you could probably call the Protect Purdue Health Center and find out",
            "replies": []
          }
        ]
      },
      {
        "id": "g0ve525",
        "content": "Question. How do you know you are living in a dedensified dorm? Are you living in what would normally be a double dorm? Because I got a double in Tarkington and although I don’t have a roommate currently, I know some people get a roommate with them at any point, so I was just wondering if you somehow know if your dorm is dedensified and won’t be getting a roommate.",
        "replies": [
          {
            "id": "g0w0l96",
            "content": "I'm in a position where they're not putting me with a roommate, and I was directly told this. It's also listed in my housing contract that I am the only resident of my room.",
            "replies": []
          }
        ]
      },
      {
        "id": "g0ver6y",
        "content": "Where do I get my PUID? (I’m an incoming freshman)",
        "replies": [
          {
            "id": "g0vunhq",
            "content": "You’ll get your PUID card during BGR, iirc.",
            "replies": []
          },
          {
            "id": "g0whu45",
            "content": "If you submitted a photo before the end of last week, your card should be waiting for you at checkin.\n\nIf you haven't yet, submit a photo... follow the instructions on the card office website.",
            "replies": []
          }
        ]
      },
      {
        "id": "g0v0o3p",
        "content": "Was there a face shield in your welcome kit?",
        "replies": [
          {
            "id": "g0v11lu",
            "content": "A full face shield? No, there was not. The safety kit includes some papers from Protect Purdue, two masks, two (small) packs of 75% rubbing alcohol wipes, pain reliever, a thermometer, and Purdue Pete themed hand sanitizer",
            "replies": []
          },
          {
            "id": "g0vumfy",
            "content": "IIRC, face shields will be provided in classes/labs that require them.",
            "replies": []
          }
        ]
      }
    ]
  },
  {
    "title": "No one asked, but after some late night extensive research, I can support, with evidence, that the McCutcheon Mile is a lie. Hawkins Hall has it worse, on average, by 0.09 miles. Do what you want with this information. (Also, apologies to my red-green colorblind boilermakers, at least you can read)",
    "selftext": "",
    "id": "o4mpyn",
    "comments": [
      {
        "id": "h2i6nff",
        "content": "The McCutcheon mile is typically used as a measure to walk to classes iirc. By only including dining courts and stuff near the freshman area of campus, it heavily skews it. If you added stuff like CL50, stew, Eng buildings, etc, you'd probably find Hawkins is closer for those.\n\nsource: Lived in Shreve and Hawkins.",
        "replies": [
          {
            "id": "h2i70f1",
            "content": "Yes, it is in reference to academic campus. But as a 2-year Hawkins resident hearing multiple McCutcheon residents over those years complain about how everything is very far away (extending the McCutcheon Mile to everything on campus), it gets annoying and loses its meaning.\n\nI also simplified academic campus to Elliott Hall, as the distances were to be non major dependent. For example, an engineering major in McCutcheon is going to have a worse time walking to class than an Agricultural student in McCutcheon is. Dining Courts and the other non food locations that are used regardless of your major were included on this list for that reason, since I know some residence halls are preferred by certain majors and not all buildings are used by all majors.\n\nAlso, “The McCutcheon Mile is a Lie” is a better title than “McCutcheon is heavily inconvenienced for academic campus while Hawkins is heavily inconvenienced for anything other than academia, especially food sources.”",
            "replies": [
              {
                "id": "h2ifh0g",
                "content": "But simplifying academic campus to 2 buildings while adding 6 for residential campus wildly skews the data unless you are doing a weighted average which it appears not.",
                "replies": [
                  {
                    "id": "h2ito3a",
                    "content": "I think you’re missing the point about why what buildings were selected. The buildings had to be neutral and non major specific, not to mention, I also didn’t feel like doing the measurements for 5-10 more buildings that are practically on to of each other. I picked Elliott cuz it is the center of academic campus and since not everyone goes to the same buildings, it is the closest I could get to an average.\n\nAlso this is a late night reddit meme and not a thesis statement. This was all done for a joke, and I wasn’t really concerned with addressing all aspects and assumptions to avoid skewed data. If you want to do a more in depth analysis with more data and locations, be my guest. I just don’t have the motivation to do that.",
                    "replies": [
                      {
                        "id": "h2j38k9",
                        "content": "All that is well and good, but you're making a definitive statement based on seriously flawed data. Best be careful with that sort of thing.",
                        "replies": [
                          {
                            "id": "h2jemhj",
                            "content": "I understand what you're saying. But also...it's a post on Reddit so I don't believe it needs to hold up to scientific scrutiny, especially considering that the subject matter is so trivial.",
                            "replies": [
                              {
                                "id": "h2mmlda",
                                "content": "Just as we don't need to take the post seriously, the OP also does not need to take our criticisms seriously either... So yes we will point out that the data uses bad data.",
                                "replies": [
                                  {
                                    "id": "h2r97zy",
                                    "content": "Fair enough. I suppose if you ARE going to make statements based on data, it's reasonable to have said data criticised.",
                                    "replies": []
                                  }
                                ]
                              }
                            ]
                          },
                          {
                            "id": "h2jeci7",
                            "content": "This “definitive statement” is not to be taken seriously. 0.09 miles is not statistically significant so you could even argue there is no difference between Hawkins and McCutcheon. And again, I get that not everyone enjoyed the joke, but don’t mislabel a failed joke as an attempt at a valid and serious argument. I made a funny conclusion about a select amount of data, flawed or not, trying to come off as sarcastic as possible. While you have a very valid point about making conclusions with flawed data, it doesn’t really apply here in a “moral sense” since this isn’t supposed to be taken seriously. The flawed logic honestly adds to the humor of the conclusion.",
                            "replies": [
                              {
                                "id": "h2jfjax",
                                "content": "There was no indication in your post that it was a joke. Because there wasn't a real indication, it looks almost like you're using the \"it was a joke\" thing as a shield. I'm not saying that you're doing that, I do not think you are, but it comes off that way. \n\nIf you made the wording in the post actually reflect it being a joke, I'd be right with you, but there's nothing to indicate that.",
                                "replies": [
                                  {
                                    "id": "h2ji0wp",
                                    "content": "Thats fair and I agree. Unfortunately, I personally thought that “late night extensive research” came off pretty sarcastically since thats my type of humor, but like you said, I guess that isn’t clear to everyone given how subjective humor is in general and thus hints at the “Its a joke” shield (Jokes also don’t translate well over the internet when humor like sarcasm is typically spoken mouth humor as it doesn’t really work 100% of the time without hearing the person’s tone and emphasis). \n\nThank you for being civil and understanding about this.",
                                    "replies": [
                                      {
                                        "id": "h2jim7s",
                                        "content": "No problem. I'm not trying to pile on or \"own\" anyone, just want to make sure we're on the same page. \n\nYou're definitely right about jokes not translating well into text. No harm done though, take care",
                                        "replies": []
                                      }
                                    ]
                                  }
                                ]
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "h2j0n0o",
        "content": "Hawkins is way closer to academic campus, that's why people live there. It's a dorm where you're expected to skip the meal plan and make your own food.",
        "replies": [
          {
            "id": "h2j18gh",
            "content": "Yes that is true, but every so often you have freshmen end up there with meal plans, and they have no option but to make the trek. Also, after 2 years of living in Hawkins, I’ve only met a very small handful of people who cook their own food in the building. The kitchen isn’t as appealing as it sounds since its a communal kitchen for anyone in the dorm, not 2-4 people like most apartments.",
            "replies": []
          }
        ]
      },
      {
        "id": "h2jyaf0",
        "content": "My mans is losing all the karma he gained from the post in the comments.",
        "replies": []
      },
      {
        "id": "h2jikxa",
        "content": "Don’t forget about Purdue Village, everything was always a more than a hike",
        "replies": []
      },
      {
        "id": "h2igw3p",
        "content": "What about hilltop?",
        "replies": [
          {
            "id": "h2iux4j",
            "content": "I exclusively did residence halls and avoided apartments in general, given the sheer number of them and how most of them are actually on top of each other. If I have motivation, I’ll do this but for now, prob not.",
            "replies": []
          }
        ]
      },
      {
        "id": "h2irf1w",
        "content": "I would have likes to see griffin north and south and just how op there placements are",
        "replies": [
          {
            "id": "h2iuzli",
            "content": "I honestly dont know how I forgot about Griffin. I was really tired when I made this but yeah, it would probably have an average just below Windsor’s.",
            "replies": []
          }
        ]
      },
      {
        "id": "h2kga9n",
        "content": "There's 3 types of lies.   Lies,  damn lies and statistics.",
        "replies": []
      },
      {
        "id": "h2jfxfw",
        "content": "Can you please add Hilltop? I'm curious... You can probably just do it from 26, the main office. It would be a close enough representation imo.",
        "replies": []
      },
      {
        "id": "h2knmx1",
        "content": "Not sure why you’d add multiple dining halls. My average distance to all the McDonalds in the world is probably 5,000 miles. That doesn’t make me far away from McDonalds.\n\nAnd how often to students go to Ross Ade Stadium vs. Armstrong Hall, just to pick one. \n\nTry it with the nearest one or two dining halls and the academic buildings that students actually travel to every day.",
        "replies": []
      },
      {
        "id": "h2jnzl3",
        "content": "Spent the first year in Hawkins, you basically either have to walk to get food or you make yourself self-sufficient by cooking yourself. Hawkins is also closest to most of the academic buildings and most of the people tend to be academically focused there. Usually the latter prevails since it's much closer to Chauncy and Target than to the food courts. If you want to learn to be more self independent and pretty academically focused, take Hawkins and skip the meal plan since you're better off walking to the nearby Target and stockin up on groceries than walking a few miles everyday for food, more often the not you end up not even getting to eat at the dining courts if you have early morning classes since you won't be able to walk there, eat, and then get to class on time (My average time between Hawkins and the food courts is 20 minutes from and back and I'm a pretty fast walker and that's all before the waiting time, factor in the average length of the lines at the dining courts and you're looking at between 25 and 45 minutes).",
        "replies": []
      },
      {
        "id": "h2k9owu",
        "content": "You need to add weights to the averaging formula. I can’t imagine you’d go to elliot or PMU frequently enough to consider it’s proximity",
        "replies": []
      },
      {
        "id": "h2kkvk6",
        "content": "This also ignores another specific point that others haven't pointed out. \n\nTime/History\n\nHawkins was built as graduate housing, and as such they didn't expect them to interact as much with the west side of campus, versus McCutcheon hall has always been undergrad. The McCutcheon mile has been a thing that even my aunt who attended in the 80's remembers. Its something that has built itself into Purdue culture, and as campus has changed over the last 40+ years, the truth to it has changed as well.",
        "replies": []
      },
      {
        "id": "h2kqqh0",
        "content": "You have to weigh these bad boys, though.",
        "replies": []
      },
      {
        "id": "h2kxc6x",
        "content": "Lol it was bad in Purdue village when they closed all the sidewalks and put fences up for construction ☠️ ☠️",
        "replies": []
      },
      {
        "id": "h2jh4cj",
        "content": "This should be a Viz in Tableau",
        "replies": []
      }
    ]
  },
  {
    "title": "How yall feel about this. Factored in quality of dorm, location, and food.",
    "selftext": "",
    "id": "1cjwngd",
    "comments": [
      {
        "id": "l2jffdj",
        "content": "Putting Windsor at C tier is crazy. Great location, has a dining court, AC, bathrooms have been remodeled recently, and has lots of history and character.",
        "replies": [
          {
            "id": "l2ko28k",
            "content": "I was misdembering someone saying that Windsor has no AC, lol. Yeah I should've gone higher",
            "replies": []
          }
        ]
      },
      {
        "id": "l2izsa8",
        "content": "Putting tark above Earhart is crazy",
        "replies": [
          {
            "id": "l2juq9u",
            "content": "Yeah agreed. Tark should be above all the rest as well imo.",
            "replies": [
              {
                "id": "l2jw8lx",
                "content": "Is tark mart still a thing? Their shitty ice cream machine is enough to make it at least a B",
                "replies": [
                  {
                    "id": "l2k2y1n",
                    "content": "I think Tark Mart closed at the end of the 2019 school year.",
                    "replies": [
                      {
                        "id": "l2k4fln",
                        "content": "Ah yep that’s when I graduated",
                        "replies": []
                      },
                      {
                        "id": "l2md6b2",
                        "content": "Damn, that was a highlight of my freshman year",
                        "replies": []
                      }
                    ]
                  },
                  {
                    "id": "l2mb19g",
                    "content": "Nope. It’s a pizza place now.",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "id": "l2pepcy",
            "content": "Tark is equivalent to Wiley and Owen. They're all identical and same distance to campus. Earhart is slightly better than shreve because it has the dining court",
            "replies": []
          }
        ]
      },
      {
        "id": "l2iynif",
        "content": "How is First Street Towers where you get singles with private bath and AC only a B?\n\nHonestly that alone is S tier. Being able to sleep and shit in peace is worth every penny.\n\nI already deal with enough stress from school, don't need roommates and floormates adding to my ever-growing list of issues.",
        "replies": [
          {
            "id": "l2jp8x3",
            "content": "Former First Street Towers resident here, 100% S tier, complimentary bathroom cleaning service, and literally across from Earhart and Hillenbrand.",
            "replies": []
          },
          {
            "id": "l2p2i68",
            "content": "FST definitely S tier — usually quiet because there aren’t parties and most times only upperclassmen get in there",
            "replies": []
          },
          {
            "id": "l2knlc1",
            "content": "Imma keep it 100, never been in just was kinda guessing on that one",
            "replies": []
          }
        ]
      },
      {
        "id": "l2jxh93",
        "content": "you didn’t factor in tark’s aura",
        "replies": [
          {
            "id": "l36mh2v",
            "content": "The shittiest dorms do have the best vibes",
            "replies": []
          }
        ]
      },
      {
        "id": "l2jcxs2",
        "content": "Y’all putting cary over Hawkins is crazy",
        "replies": [
          {
            "id": "l2pevtz",
            "content": "Cary has arguably the best location of all the dorms",
            "replies": []
          },
          {
            "id": "l2lycfx",
            "content": "Cary suites are the best dorms on campus",
            "replies": []
          }
        ]
      },
      {
        "id": "l2jtc2q",
        "content": "What. Earhart is the best. You got a bus stop and cafeteria that serves breakfast lunch and dinner. It's a gold mine in the winter, you don't have to go outside like the plebs to find food.",
        "replies": []
      },
      {
        "id": "l2kh29v",
        "content": "As someone who lived in Meredith South and Windsor, I don't think Meredith south is S tier. \nI would nEver put Wiley on par with Windsor.",
        "replies": [
          {
            "id": "l2mdr39",
            "content": "I got flesh-eating bacteria from the toilet seats there. Fun times",
            "replies": []
          }
        ]
      },
      {
        "id": "l2isghe",
        "content": "https://preview.redd.it/tun7tt6htdyc1.png?width=530&amp;format=png&amp;auto=webp&amp;s=be9318be25f33351792a9ecd07e82af04b0dac9b\n\nmine better",
        "replies": [
          {
            "id": "l2jq7ex",
            "content": "Hawkins should be B or C, it's far from residential campus but close to Chauncey and WALC. Also singles are nice",
            "replies": [
              {
                "id": "l2lihog",
                "content": "I disagree, older dorm, inconsistent ac, no more pmu meal swipes. I will consider bumping it to C- for the pmu tunnels and being close to classes",
                "replies": [
                  {
                    "id": "l2ll2of",
                    "content": "oh that sucks, I didn't know about the pmu swipes",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "id": "l2l7cz8",
            "content": "Tark indeed deserves to be on it's own separate, bottom tier. Disagree with Cary, though depending on which part of Cary. If you're closets and no A/C, put it with Meredith/Wiley, but the nice Cary rooms are \\*\\*nice\\*\\*.",
            "replies": [
              {
                "id": "l2liral",
                "content": "Cary south = D tier, rest of cary can be B-, Cary south not F tier bc of Knight spot and close to classes and 2 dining halls",
                "replies": []
              }
            ]
          },
          {
            "id": "l2pfcp7",
            "content": "At least swap hillenbrand and cary. Cary has nice dorms and probably the best location of all of them. Hillenbrand is nice, but it's far and the dining court is one of the worst ones",
            "replies": [
              {
                "id": "l2pmcbs",
                "content": "L take. Hilly brunch on top, earhart is F tier dining",
                "replies": []
              }
            ]
          },
          {
            "id": "l2isxo3",
            "content": "NUH UH",
            "replies": []
          }
        ]
      },
      {
        "id": "l2kardz",
        "content": "Move Windsor to B tier, First St towers to S tier, and Earheart up to C.",
        "replies": []
      },
      {
        "id": "l2ji0tz",
        "content": "How is Cary A tier. Hawkins deserves better than a C",
        "replies": [
          {
            "id": "l2kcedz",
            "content": "Cary suites are honestly in a really good spot. Close to two dining courts (Ford and All American if it’s still there), close to the Engineering Mall, close to both Ross-Ade and Mackey, you have AC and a sort of private bathroom, etc. Cary SOUTH on the other hand, where I got to stay my freshman year, is a wholleeee different category. Location is still great, but: no AC, community bathrooms, no water bottle filleruppers except for one spot in the whole building, and rooms so small Cary is literally known as the Closets. And you have a roommate in that tiny, unairconditioned room.",
            "replies": [
              {
                "id": "l2kgf95",
                "content": "I lived in Cary South in 2009-10 and those horrible lofted beds really taught you some things about life.",
                "replies": []
              },
              {
                "id": "l2lur2m",
                "content": "RIP Knight Spot",
                "replies": []
              },
              {
                "id": "l2l8qxk",
                "content": "Okay that's fair, didn't realize the suites were different from what you typically hear people hating Cary for",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "l2iv63c",
        "content": "As far as I have heard shouldn't Hillenbrand be at the top?",
        "replies": [
          {
            "id": "l2kcw2d",
            "content": "Yeah man I had a room there to myself my last year it was the best dorm ever. Amazing all you can eat wings bar for lunch, quiet, near rec center. Just an amazing place to live",
            "replies": []
          },
          {
            "id": "l2lixgn",
            "content": "Na, newer dorms are nicer, dining court is the only thing keeping it from being C",
            "replies": []
          }
        ]
      },
      {
        "id": "l2kmzr9",
        "content": "Hawkins should be higher due to its location to bars and the increased freedoms it allows (optional meal plan, guaranteed parking permit)",
        "replies": []
      },
      {
        "id": "l2l85ul",
        "content": "i get that hawkins is far away from dining courts but as a former resident of 2 years this is just wrong",
        "replies": [
          {
            "id": "l2l892k",
            "content": "and also as a former owen hall resident... how is it so high up? just in proximity to ford??? this is madness. what is your point system?",
            "replies": []
          }
        ]
      },
      {
        "id": "l2j68lf",
        "content": "I’m super old now and haven’t been back in a while. \n\nCan anyone tell me what makes Harrison better than Owen, Wiley, Tark, etc.?",
        "replies": [
          {
            "id": "l2jf1x9",
            "content": "+1 I lived in Tark and I don't remember it being as bad as this thread makes it out to be 😅",
            "replies": [
              {
                "id": "l2jhqcn",
                "content": "When I was in the residence hall they all had cafeterias so that wasn’t a concern. It was mostly just distance with shreve and Owen maybe the best. Anyway, just curious. I know it’s nothing like when I was there.",
                "replies": [
                  {
                    "id": "l2k5cll",
                    "content": "I don't know if it's always been there, but there's a burger place and small convenience store on the first floor. Though their hours are terrible.",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "id": "l2lj1jk",
            "content": "AC, remodeled bathroom, no bats or roaches",
            "replies": []
          },
          {
            "id": "l2pfra4",
            "content": "It's not. The rooms are nicer but it's pretty far. Owen, Wiley, and Tark are equivalent better for the location.",
            "replies": []
          }
        ]
      },
      {
        "id": "l2jeyux",
        "content": "I lived in Meredith when it was a big X, co-ed, and didn't have AC. Would love to see how it got re-done!",
        "replies": [
          {
            "id": "l2l80bc",
            "content": "Kinda got redone in like 2016-2017. They added swipe access on the first floor to all the wings. That's pretty much it. Oh and they made the basement gathering room a restaurant thing. Dunno if they've changed it since, but I'd guess not apart from turning it back into an all-girls dorm.\n\n  \nMeredith gang! Lived there from 2013-2017 because it was the cheapest dorm.",
            "replies": [
              {
                "id": "l2laert",
                "content": "That's dope! We probably crossed paths! I was on the 2nd floor right in the middle above the lobby. Probably good they changed it to all females, we had a lot of problems with random guys just coming down on our floor and doing whatever they wanted my year.",
                "replies": []
              }
            ]
          },
          {
            "id": "l2k56cv",
            "content": "It didn’t get re done, but it’s all girls now",
            "replies": []
          },
          {
            "id": "l2k0qm3",
            "content": "It’s getting redone?",
            "replies": [
              {
                "id": "l2k5s2e",
                "content": "They added a whole building south of the X of the existing Meredith, and creatively called it Meredith South. I don't know if there's anything changed about existing Meredith, or if there are plans to change it.",
                "replies": [
                  {
                    "id": "l2k9o3o",
                    "content": "When I lived there in 2015 there was no other buildings, no key card or swipe entry, first and second floor were female and third floor was male.\nI moved to first Street the year they started tearing up the parking lot to put the new building in but it was construction my next 3 years. \nCool beans!",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "l2k39k2",
        "content": "Can’t believe no one is talking about how disrespectful the mccutcheon tier is",
        "replies": [
          {
            "id": "l2nhox0",
            "content": "I loved living there but that was back when there was a lot less choices. We all called it mc far as fuck but the bus route was clutch and it didn’t bother me at all being at the back of campus",
            "replies": [
              {
                "id": "l2ox9m2",
                "content": "I’m talking about how they labeled it as murder. Someone died there and they’re making a joke out of it",
                "replies": [
                  {
                    "id": "l2pak2m",
                    "content": "Oooooh I graduated a while ago I didn’t know that. I agree, very disrespectful",
                    "replies": []
                  },
                  {
                    "id": "l2sh9ov",
                    "content": "So fun / not so fun fact: I was doing laundry that night, going down the elevator and waking down the 1S hallway to go to the laundry room. I walk back out with my bag and a cop with the nerf shotgun is waking to the east end of the hall and just says, “you should probably stay in your room tonight,” and just keeps going. \n\nTook me like a week to figure out what had happened. That was my 3rd year in 8S. \n\nAs for the dorms, 1 year in Shreve, 3 in McCutcheon, 1 semester in 1st street. Shreve was closer, McCutcheon had better bathrooms, 1st street was great all around.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "l2js9nd",
        "content": "windsor isnt that bad only the dining court",
        "replies": []
      },
      {
        "id": "l2jy5tn",
        "content": "harrison grill is not good anymore from what I tried this year",
        "replies": []
      },
      {
        "id": "l2k67p6",
        "content": "Hillenbrand needs to be higher!",
        "replies": []
      },
      {
        "id": "l2kmfr7",
        "content": "First Street is S tier. They’re all singles with AC and a private bath. They’re right across the street from Earhart and a bus stop. And for the most part they are quiet so you can actually study in your room or sleep at night.",
        "replies": []
      },
      {
        "id": "l2j6ryr",
        "content": "What’s S?",
        "replies": [
          {
            "id": "l2n16kb",
            "content": "Superior",
            "replies": []
          }
        ]
      },
      {
        "id": "l2kclab",
        "content": "TARK TARK TARK TARK",
        "replies": []
      },
      {
        "id": "l2kcxmx",
        "content": "You need to separate Cary South from the rest of Cary Quad. Same dorm, way different experience",
        "replies": []
      },
      {
        "id": "l2kubf2",
        "content": "What kind of crack are you smoking",
        "replies": []
      },
      {
        "id": "l2x1x7m",
        "content": "I know this list is just dorms, but Hilltop mogs all of these. Hilltop is better than Frieda for half the price.",
        "replies": [
          {
            "id": "l34w8z2",
            "content": "Bro hilltop was built by John purdue himself, it's so old. I've seen hilltop, the bathrooms are scaaary ancient, and similar to the H dorms, it shows its age.\n\nIt's certainly a good deal for an apartment type dorm, but it's not nicer than Frieda lol",
            "replies": []
          }
        ]
      },
      {
        "id": "l2jvdxx",
        "content": "Meredith South is great until you're put into a room directly across from the trash compactor so you hear it go off 10 times a day and twice a night",
        "replies": []
      },
      {
        "id": "l2jwsdn",
        "content": "Having lived in both id put mcutcheon over shreve. Sure it’s a longer walk, but the bathrooms are nicer and you have a built in parking lot.",
        "replies": []
      },
      {
        "id": "l2k2xrm",
        "content": "Is Earhart food bad now? Back when I was there, it was one of the top places to eat.",
        "replies": [
          {
            "id": "l2ktku7",
            "content": "Earhart was good when I went too (2017-2021) but I think in like 2020 they switched the food provider or something and it got way worse",
            "replies": []
          },
          {
            "id": "l2pg80e",
            "content": "All the food is kinda bad now. But Earhart was and is still one of the better dining courts",
            "replies": []
          },
          {
            "id": "l2lygv0",
            "content": "It’s shit",
            "replies": []
          }
        ]
      },
      {
        "id": "l2k5w7h",
        "content": " the cary suites are 100% better than meredith south and has a case for being s tier. The only dorms id put above the cary suites are winifred parker and first srreet singles. The cary suites have all of the perks of frieda parker but the rooms are significantly more spacious, and you get a walk in closet. The only advantage frieda parker has on the cary suites is location. Meredith south is on the same level as dorms like hillenbrand and shreve. The only difference is its a newer building",
        "replies": []
      },
      {
        "id": "l2kh7za",
        "content": "Swap frieda and Winifred. Winifreds rooms are bigger and have higher ceilings.",
        "replies": []
      },
      {
        "id": "l2krzsu",
        "content": "tark aura puts it #1",
        "replies": []
      },
      {
        "id": "l2kskab",
        "content": "Cary South 2015-16 and I couldn't have asked for a better floor. Melting in the late summer heat in those tiny rooms brought my floor together and built character. Cary East 2016-17, much nicer and so close to Mackey/Ross Ade. I'll stand by that beautiful ol' quadrangle 'til I die!",
        "replies": []
      },
      {
        "id": "l2ldb43",
        "content": "Red should be the worst and green should be the best change my view",
        "replies": []
      },
      {
        "id": "l2lkw96",
        "content": "tark too low",
        "replies": []
      },
      {
        "id": "l2ltdd3",
        "content": "How is Meredith still around?! Iived there almost 10 yrs ago and it was like old then. I can't imagine it now. \n\nDid have a good year there.",
        "replies": []
      },
      {
        "id": "l2lzivk",
        "content": "ok but like earhart&gt;&gt;&gt;&gt;",
        "replies": []
      },
      {
        "id": "l2m2zw9",
        "content": "The murder category is really insensitive especially when his family are probably on the internet ijs",
        "replies": []
      },
      {
        "id": "l2m8bvx",
        "content": "I see you have made the mistake of mislabeling Wiley North and Wiley North North.",
        "replies": []
      },
      {
        "id": "l2mbjwu",
        "content": "Tark beats Owen any day because of proximity to CoRec and central between Wiley, Parker and Ford food spots.",
        "replies": []
      },
      {
        "id": "l2mdmq2",
        "content": "Tark and Wiley are LITERALLY the same building",
        "replies": []
      },
      {
        "id": "l2mdpkp",
        "content": "Going to assume you never lived in a Cary Closet!",
        "replies": []
      },
      {
        "id": "l2nbnvr",
        "content": "first street towers should be higher, lived in mrds then fst and fst is WAYYYY better other than the ac is a bit wishy washy.",
        "replies": []
      },
      {
        "id": "l2nff71",
        "content": "Windsor is better than Hawkins in my opinion.  Lived in both and had horrible horrible time in Hawkins (roaches,nothing working,no community,dining courts so far). And considering I moved back to Windsor after nearly dying and having the RA call the EMTs on me...that speaks volumes. \n\nMaybe it was better back in the day or maybe they made some improvements, but Windsor especially duhme is better.",
        "replies": []
      },
      {
        "id": "l2nknh3",
        "content": "What about Hilltop?",
        "replies": []
      },
      {
        "id": "l2og2e2",
        "content": "Frieda ain’t that great, some of the rooms are pretty small. It also just looks like a hotel and has no character.",
        "replies": []
      },
      {
        "id": "l2r14to",
        "content": "Why is Freida Parker below Meredith south nah",
        "replies": [
          {
            "id": "l34wfbh",
            "content": "it is, in fact, next to it",
            "replies": [
              {
                "id": "l36u8q1",
                "content": "Usually when it’s farther from the s it means it’s lower. That’s why I assumed you put Meredith south as #1",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "l2s69i4",
        "content": "Girl Tark 😭 the living conditions in Meredith suck but the vibes are there. Super cute building if you romanticize it a little.",
        "replies": []
      },
      {
        "id": "l36mngp",
        "content": "Hilltop, Aspire, and URBA would be forgotten",
        "replies": []
      },
      {
        "id": "l2ixexu",
        "content": "Wiley should be higher just for the food",
        "replies": []
      },
      {
        "id": "l2jjpgw",
        "content": "it's been a while since I've been on campus, but Wiley being next to the (arguably best) dining court and the gym made it extremely convenient",
        "replies": []
      },
      {
        "id": "l2kp28d",
        "content": "RIP to PV, got demolished",
        "replies": []
      },
      {
        "id": "l2jmx3f",
        "content": "Hillenbrand has the worst location and the food is worse than Earhart",
        "replies": []
      },
      {
        "id": "l2k59tw",
        "content": "Tark on top respectfully. Had to be there sorta thing.",
        "replies": []
      }
    ]
  },
  {
    "title": "250 POUNDS of FREE PANCAKES TONIGHT",
    "selftext": "If you’re looking for something to do with your Friday night.\n\nMcCutcheon Hall is hosting a Midnight Pancake Megafest for the end of the year.\n\n8-12PM tonight, Friday night, on the McCutcheon front lawn.\n\nNigh infinite pancakes.\n\nVery Expensive and High-Tech water rifles.\n\nPurdue Pete will be there from 9-10\n\n25 Gallons of chocolate.\n\nFat ass speakers.\n\nYour mom’s sickest beats (pinky promise)\n\nWaaaay more idek. Show up to find out, we got shit you’ve never seen.\n\nLiterally everyone and anyone is invited.",
    "id": "12uiq8p",
    "comments": [
      {
        "id": "jh73npg",
        "content": "I'm not saying you should, but I'm also not saying you shouldn't put chocolate syrup in the water rifles.",
        "replies": [
          {
            "id": "jh7494w",
            "content": "Too dense unfortunately :(",
            "replies": [
              {
                "id": "jh74zfc",
                "content": "Too viscous? Just get it hotter",
                "replies": [
                  {
                    "id": "jh7c8q7",
                    "content": "Now I’m imagining people drenching each other in scalding napalm-like chocolate syrup",
                    "replies": [
                      {
                        "id": "jh7d63c",
                        "content": "Oh, boohoo, everyone's gonna get 2nd and third degree burns. This generation is so soft. Fine. Everyone should be coated in a thin layer of heat resistant gel prior to participating.",
                        "replies": [
                          {
                            "id": "jh7tgai",
                            "content": "It’s because no one wants to work these days and just wants government handouts /s",
                            "replies": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "jh7nrl9",
            "content": "That’s how everyone and anyone is invited turns in to everyone and anyone except r/boiler2001",
            "replies": [
              {
                "id": "jh7o2vs",
                "content": "That's fine. I'll have my own pancake party. With blackjack and hookers. In fact, forget the pancakes!",
                "replies": [
                  {
                    "id": "jh7ow6m",
                    "content": "Can I come to this party? I don’t even like pancakes, I prefer waffles.",
                    "replies": [
                      {
                        "id": "jh7turu",
                        "content": "I suppose, if you bring your own hookers",
                        "replies": [
                          {
                            "id": "jh7u4fj",
                            "content": "Could I barrow yours if I bring cards and waffles?",
                            "replies": [
                              {
                                "id": "jh7uc17",
                                "content": "I don't even like sharing my phone charger, so that's gonna be a no",
                                "replies": []
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "jh78pjp",
        "content": "Is this a bait or deadass",
        "replies": [
          {
            "id": "jh7cpg6",
            "content": "Real. Please stop by!!",
            "replies": []
          }
        ]
      },
      {
        "id": "jh7rku5",
        "content": "[deleted]",
        "replies": [
          {
            "id": "jh8ol1p",
            "content": "can confirm i got a spiderman pancake",
            "replies": []
          }
        ]
      },
      {
        "id": "jh7dh8y",
        "content": "Now I’m curious, are we talking 250 lbs of pancake powder mix or 250 lbs of batter?",
        "replies": [
          {
            "id": "jh7gj6y",
            "content": "Powder mix. Untold piles of pancakes await",
            "replies": []
          }
        ]
      },
      {
        "id": "jh71s6i",
        "content": "Woah",
        "replies": []
      },
      {
        "id": "jh7jxrr",
        "content": "The Googie Dobbler will be in attendance.",
        "replies": [
          {
            "id": "jh7loc8",
            "content": "The schlobby dobbler will be there? I will come too now",
            "replies": []
          }
        ]
      },
      {
        "id": "jh7ohbi",
        "content": "Suggestion: Get pure maple syrup instead of the artificial pancake syrup from Aunt Jemima (Pearl Miling Company). The pancakes would taste way better!",
        "replies": [
          {
            "id": "jh7u4vo",
            "content": "Pure Maple Syrup sponsored by Zach Edey",
            "replies": []
          }
        ]
      },
      {
        "id": "jh7momt",
        "content": "Are the pancakes free?",
        "replies": [
          {
            "id": "jh7o1f0",
            "content": "Of course",
            "replies": []
          }
        ]
      },
      {
        "id": "jh844vx",
        "content": "Are they carding? Alumni on the way!",
        "replies": []
      },
      {
        "id": "jh8f9e4",
        "content": "Minus the downpour for a little, those pancakes were better than hilly brunch… thanks for the fun time!",
        "replies": []
      },
      {
        "id": "jh8j67f",
        "content": "Thank you so much for having us McCutcheon, we had a blast and played some hella sick beats tonight. \n\nLooking forward to more Pancake-fests and similar McCutch events in the future!",
        "replies": []
      },
      {
        "id": "jh7qel6",
        "content": "[deleted]",
        "replies": []
      }
    ]
  },
  {
    "title": "Mccutcheon Hall Relationship Fiasco",
    "selftext": "Whoever decided to have an screaming argument about a relationship outside Mccutcheon at 4 am (8/28), please do that somewhere else. I value my sleep and so do others. Plus, that was rough. Y'all need some therapy.",
    "id": "wzyp30",
    "comments": [
      {
        "id": "im57qbb",
        "content": "sorry bro",
        "replies": []
      },
      {
        "id": "im5iytr",
        "content": "If you have to scream then you should just break up and end the conversation there.",
        "replies": [
          {
            "id": "im73jjb",
            "content": "But I can't break up with my math homework and graduate on time, can I?",
            "replies": []
          }
        ]
      }
    ]
  },
  {
    "title": "I've been placed in McCutcheon with 8 roommates and I'm very displeased. (RANT)",
    "selftext": "First of all, I would like to say that I am an incoming freshman. On the original housing survey I submitted my preferences as Single with \"AC &gt; Single without AC &gt; Double with AC &gt;Double without AC\", and so on. I don't consider myself a very social person, especially when it comes to sleeping with other people in the same room. However at the time, I knew that getting any of these would be extremely unlikely, and that I would just make do with whatever I got.\n\nFast forward to this month. I received the unassigned housing survey email, saying that I would be placed in either auxiliary housing or an apartment. At this point, I was a bit disappointed, but most of the choices on this survey were only a slight inconvenience. In my opinion, the only extremely unfavorable option was the \"Central Campus Quadruple Plus  (&lt;10 occupants in large Residence Hall space).\" And so, I didn't worry to much about it.\n\nTo my surprise last week, I was placed into McCutcheon with 8 roommates, an option worse than any of the housing options listed in the email. So not only am I getting put with 8 other people, I am going to be walking about 20 minutes to get to classes as I wouldn't describe McCutcheon as \"Central Campus\". Even more odd, I find nothing that indicates this to be a \"large residence hall space\", as the housing portal says the room type is \"Six Person Room w/ AC\". Does this mean they have converted a 6 person room to fit 8 people? What the hell even is a 6 person room anyway?\n\nI've looked on this subreddit for people in similar circumstances, but I have yet to find anyone talking about being placed with more than four people. The little information I have found has been from [here](https://www.housing.purdue.edu/my-housing/options/special-housing/temporary.html) which seems to indicate that I will be in the room for the duration of my freshman year. However, I am unsure if I have been placed in what the article is describing as a \"reconfigured auxiliary space\" or if I am one of the few students placed in \"Limited-term housing.\"\n\nAt this point, I feel cheated, and to some extent, I am regretting choosing Purdue. If anyone has any additional information about all of this, I would be extremely happy to hear it.\n\nEdit: I've been searching for apartments and I'm really at a loss. Almost all the apartments within walking distance of campus are either unavailable or in the thousands. I've found a few that are little ways off campus, but if I didn't want to pay over a thousand, I would have to have a few roommates. I'm absolutely fine with this but I don't know HOW to find roommates. I had a friend that said his landlord automatically assigned him with two, but is that true for all apartments? I guess I don't even know where to start really.",
    "id": "ouaw9e",
    "comments": [
      {
        "id": "h71s786",
        "content": "Very sorry to hear this, I was a resident at McCutcheon last year as a freshman in a traditional double. I’ve been all around the building and I’m pretty familiar with it. I’m not sure where they plan to fit 8 residents in a “6-person room”. My guess is that it would be in one of the study-areas or even the lounge. McCutcheon is the opposite of central campus and that has got  to be at the very least false advertising.",
        "replies": [
          {
            "id": "h71tsw1",
            "content": "Farthest dorm on campus. Def not central. Also, the triples have like 2 sections from what I remember. A bed area and a sitting area, so maybe they made that 2 bed areas? But to add 2 MORE people? Seems pretty tight to me. McCut doesnt have study lounges on the floors to convert. and they sure as hell wont make those conference rooms dorm rooms.",
            "replies": []
          }
        ]
      },
      {
        "id": "h72v107",
        "content": "As I was one of the guys in that picture you used and in your exact situation 3 years ago, I might be able to help out. You were probably put in temporary housing. In the loading dock of Harrison and McCutcheon there are doors that lead to the temporary housing area. In my case, I was placed in the loading dock of Harrison, in a room that is labeled \"The outback.\"\n\n5 bunk beds, 10 guys total, 1 toilet, 1 urinal, and 1 shower. That's all we had for 10 guys for a few months before they found the space to move us out. This experience was definitely confusing at first. But since I didn't know anyone coming into purdue, it actually was kinda nice. \n\nPretty much all of us got along really well and were respectful of others boundaries. I'm still close friends with most of them these days, and I'd say that this experience is fully dependent on who you are with. And I would be willing to bet that you are one of the few put in temporary housing. I know it can be a shock at first, but let me know if you have any other questions!",
        "replies": []
      },
      {
        "id": "h71tlck",
        "content": "Woah woah woah. I was an RA at MCUT. I love it dearly but those triples cant comfortably hold 8 people! At least not how I remember it. I'm so sorry man, that is absolutely an awful situation on your room. The walk isnt too bad though, though I may be biased. Maybe you can transfer out of it.",
        "replies": []
      },
      {
        "id": "h7313ue",
        "content": "I simply don’t understand why it’s so goddamn hard for the university to stop accepting more ppl than they have capacity for… you don’t get to just collect money from ppl without first confirming that u have the ability to reasonably and comfortably house and instruct them. I’m so sorry they’ve put you in this position.",
        "replies": [
          {
            "id": "h739mhs",
            "content": "Two words: frozen tuition. I get that it helps all our pockets, but seriously, it hasn't even kept up with inflation.",
            "replies": [
              {
                "id": "h74zct8",
                "content": "But at what point does it really help when there are people in situations like this, some dorms / buildings having awful accommodations?",
                "replies": []
              },
              {
                "id": "h79pvep",
                "content": "THIS^^^. ABSOLUTELY THIS^^^\nUniversity Residences did not cause this.  They just have to deal with the fallout.  When administrators have the attitude of “everyone that wants to live on campus should have the opportunity”, UR has to say “oh, ok…” and make that happen.  But, it doesn’t really happen that way, as 10 pounds of crap doesn’t fit in a 5 pound bag.",
                "replies": []
              },
              {
                "id": "h73sw5s",
                "content": "Fuck mitch",
                "replies": []
              },
              {
                "id": "h8dn4qn",
                "content": "whether our frozen was tuition or not, this mitch would have accepted way more students than needed knowing a quarter of the incoming students will pay for tuition for some years and then eventually drop out. only 75% of the students will graduate within SIX years. maybe it's his way of increasing the reputation/specs/profile of potential purdue graduates as the incoming freshman will be competing for resources to do well here. Good luck getting help if you're in CS especially-- you will probably wait even more hours to get help from a TA.",
                "replies": []
              }
            ]
          },
          {
            "id": "h79fwr0",
            "content": "s/university/Mitch/",
            "replies": [
              {
                "id": "h79fxkr",
                "content": "I simply don’t understand why it’s so goddamn hard for the **Mitch** to stop accepting more ppl than they have capacity for… you don’t get to just collect money from ppl without first confirming that u have the ability to reasonably and comfortably house and instruct them. I’m so sorry they’ve put you in this position.\n\n^^This ^^was ^^posted ^^by ^^a ^^bot. ^^[Source](https://github.com/anirbanmu/substitute-bot-go)",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "h72oe9m",
        "content": "Just an fyi, you aren't in a triple. Youre in the outback which is a much larger room than the triple. Still not ideal and purdue has had this problem for the last couple years (at least while I've been here) where they over admit and sadly people like you get placed in less than ideal situations. \nI will say that those rooms are usually loved though by the people who live in them and that even if you end up not enjoying your time there, Purdue is periodically working to move people out of those rooms and into better living situations so I don't think that is going to be your permanent place to live in for the year. \nAlso if you really don't like the room, thankfully there are several study rooms and lobbies that you can escape to when you don't feel like you can be in the room\nLastly, as someone who has made the walk a plethora of times, there are also buses that will get you to campus for days when you don't feel like walking or even electric scooters to rent.",
        "replies": [
          {
            "id": "h72pxzu",
            "content": "As far as how long this has been going on - I was a freshman in 2005 and it has been an issue every year since. (Someone in my family has been attending for all but two years since I started.) I feel like I was warned about it before I started, but the idea of living in the dorms with so many other people was horrifying so I worked almost full time and had an apartment.",
            "replies": [
              {
                "id": "h79jt3u",
                "content": "Not every year, I was a freshman in McCutcheon in 2014-15 and never heard of this situation",
                "replies": [
                  {
                    "id": "h79llcx",
                    "content": "Well,  that lines up... one sister graduated in 13 and the next didn't start till 15! (Also,  I had a baby in 2015 and admittedly talked more about baby stuff than dorm situations with her that year. )",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "h721iff",
        "content": "Is there any way you can cancel your housing contract as a whole now and just get an apartment? At least you’d have your own room but I’m unsure if you’d be allowed to cancel so late…",
        "replies": [
          {
            "id": "h73ifv4",
            "content": "Off campus housing is also limited, I have a few friends scrambling to find a place and they're struggling. As shitty as it is, sticking with the housing contract is probably the only way to guarantee a relatively short commute to class",
            "replies": [
              {
                "id": "h73n90r",
                "content": "It depends. I was looking for housing till upto a week ago and I personally did find a lot of places available.",
                "replies": [
                  {
                    "id": "h73o07a",
                    "content": "Depends on price, there's availability but rent prices are a lot higher compared to the cost of dorm living. Hub and rise have plenty of rooms, but for 800-1,000/mo, which is out of most people's price range",
                    "replies": [
                      {
                        "id": "h73oqo4",
                        "content": "True, but I personally had a different experience. Places like Basham still have availability for 450 a month. Subleasers have space for roughly 500 a month.",
                        "replies": [
                          {
                            "id": "h73p8li",
                            "content": "Basham's full at that price point as of a week or two ago. My friends are mostly talking with subleasers at this point, may end up couch surfing at my place for a bit",
                            "replies": [
                              {
                                "id": "h73q0wf",
                                "content": "Damn, I’m sorry to hear that. If your friends need to find a place still just feel free to refer them to me. I love house hunting and I’m constantly on the Facebook page if they need help!! Can’t make promises but I can try my best.",
                                "replies": []
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "h8dnfqz",
            "content": "off campus apartments are all sold out. even the shitty ones. granite and weida are all fully booked. ironic",
            "replies": [
              {
                "id": "h8dnjzl",
                "content": "Now there is even less incentive for these apartment agencies to have responsible management (they were already shit). Because every year, they are going to be fully-booked with a long waitlist even if people decide to terminate their lease anyways.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "h7254hw",
        "content": "Cancel your contract and search off campus. Anything is better than living with seven other people in a place meant to house four at most.",
        "replies": [
          {
            "id": "h73f8sg",
            "content": "Don't do this. Housing near campus is mostly taken, your closest options would probably be the apartment buildings where your paying north of 800 a month (most rooms start around $900). Living with 8 people is shitty but it beats having to commute from across the river with no campus parking spot\n\nSource: have several friends scrambling to find housing right now",
            "replies": [
              {
                "id": "h75rkbp",
                "content": "Um.. I found a place in the Chauncey area like two weeks ago after canceling my contract... Is it that bad now?",
                "replies": [
                  {
                    "id": "h78y8vx",
                    "content": "Just curious, how did you go about canceling your contract? How much of a refund do you get if at all?",
                    "replies": [
                      {
                        "id": "h79d0aj",
                        "content": "It cost me like 30$ for cancelation? I just called them and asked them to cancel, they were taking a lot of requests this year because of the housing situation",
                        "replies": []
                      }
                    ]
                  },
                  {
                    "id": "h75txr0",
                    "content": "Yep, I signed around then too. Lucky I did, housing shit got bad right after that and all the buildings near mine filled up. Friend couldn't even get a quote under 800",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "h72caa5",
        "content": "Really? 8 other people? Wtf.",
        "replies": []
      },
      {
        "id": "h72t23u",
        "content": "I was put in the McCurcheon 10 person room back in 2016. It was actually not bad at all, we had our own bathroom and everything... Though it was on the loading dock lol. It was the temp housing and I was the last to leave so I had this giant ass room to myself for about a week lol.",
        "replies": []
      },
      {
        "id": "h71qkpb",
        "content": "[deleted]",
        "replies": [
          {
            "id": "h71x0nf",
            "content": "They can't just build a building in the blink of an eye. Last semester they were building 5-6 apartments/residence halls. They definitely accepted too many freshman, but at least they're trying to make room.",
            "replies": [
              {
                "id": "h72c86w",
                "content": "Or just not accept as many students? The housing crisis is the administration own fault at this point.",
                "replies": [
                  {
                    "id": "h72h3bl",
                    "content": "The problem wasn’t how many students the accepted, it was how many students accepted their offers. It was much more than usual, likely fueled by COVID. Going into this year, UR had planned on no auxiliary housing.",
                    "replies": [
                      {
                        "id": "h73eghv",
                        "content": "This is not the first time it has been a problem and yet the administration changed nothing about their admission policies. COVID is not an excuse nor is them being surprised by how many people accepted their offers.",
                        "replies": [
                          {
                            "id": "h73i4md",
                            "content": "The problem has never been this bad, where they are putting students in study rooms. Past aux housing is for only a couple weeks, it’s not equivalent. \n\nI’m not defending Purdue or justifying this because I know I would be royally pissed if I was put in one of these, but I was a student ambassador for UR and I know that they were more than prepared for the expected number of students, and more students accepted their offer than normal.",
                            "replies": []
                          }
                        ]
                      },
                      {
                        "id": "h72woa3",
                        "content": "That and off campus pricing has skyrocketed making on campus living a preference more than usual. Frats and sororities can pull some out after rush, others will drop school entirely. The schools actuaries have done a poor job analyzing the situation, but we have built a lot of dorm space in the past 5 years that pairs the number of students added, there’s more to the problem that’s causing the crisis.",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "h72ps58",
        "content": "I don’t know what the fuss is about walking to campus from McCutcheon.  It’s not that bad.  You got feet you got legs use them",
        "replies": [
          {
            "id": "h73m2or",
            "content": "Yes this! Although the distance is less convenient than other dorms, I ended up finding the walk a good way to start the day and very relaxing after sitting around studying/in class on campus. It also gave me less incentive to stay in my room all the time",
            "replies": []
          },
          {
            "id": "h72xdwq",
            "content": "Exactly! You know what's up! I like to call McCutcheon the suburbs of campus because it's distanced and relatively quiet.",
            "replies": [
              {
                "id": "h73lbx7",
                "content": "It’s really close to 2 dining courts too.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "h736put",
        "content": "This situation is so bad that I entirely thought this post was a joke.",
        "replies": []
      },
      {
        "id": "h75co01",
        "content": "You could look at Village West, I don't know if they still have rooms, but they assign roommates if you don't have any. Have a bus to campus, and are fully furnished. The most expensive is $490 before utilities, which are bundled together for like $75. Just a thought though",
        "replies": [
          {
            "id": "h75g5ft",
            "content": "Thanks for the information. I was avoiding this one because of the distance and the fact I would have to find a roommate. Since that is not the case, I will definitely be considering.\n\nEdit: Never mind, it seems they don't have any availability until 2022",
            "replies": [
              {
                "id": "h75lug5",
                "content": "Awww I’m sorry!",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "h723hsa",
        "content": "CANCEL UR CONTRACT\n\nget an apartment off campus thats on a loop that goes to purdue",
        "replies": []
      },
      {
        "id": "h732401",
        "content": "Mccutcheon isn’t that bad. I lived there sophomore year and in Harrison freshman year. The sloop takes you directly to campus very quickly and there’s 4 double buses in that route.",
        "replies": []
      },
      {
        "id": "h73wnvx",
        "content": "The location is not that bad. AC and a single are luxuries, so you can't be too surprised by that. \n\nEight people is a lot, but try to make it work and spin it to your advantage. You will have the opportunity to make more friends.",
        "replies": []
      },
      {
        "id": "h732fni",
        "content": "Thank you all for your many replies and advice. I have been weighing my options in terms of whether I should just bite the bullet or cancel my contract (which I previously did not know was an option). My plan right now, which I am unsure if it is feasible, is to try and get an apartment. I don't know if I can cancel my contract, but if I can't its not that big of deal. I'm literally paying less than anyone else for Purdue Residences.\n\nSome of you pointed out that this likely is temporary housing, and although that contradicts what the article says, I will likely be contacting University Residences about the matter. \n\nAlso, I might be willing to have a roommate to cut down on the cost. How would I go about finding one?",
        "replies": [
          {
            "id": "h73b7rv",
            "content": "If you have 8 roommates, you are probably in the \"limited-term auxiliary housing\", not the \"reconfigured spaces\" housing, so it should be temporary.",
            "replies": []
          }
        ]
      },
      {
        "id": "h7364fn",
        "content": "[deleted]",
        "replies": [
          {
            "id": "h73v6po",
            "content": "It’s always time for orgies.",
            "replies": []
          }
        ]
      },
      {
        "id": "h76g916",
        "content": "McCutcheon is not that far away man. I lived in Purdue Village my first year.",
        "replies": []
      },
      {
        "id": "h77ssy7",
        "content": "The Quarters at West Lafayette. Good appartments. Cant really walk to campus, but there is a bus system that comes around every 15 minutes that will take you all over. Free parking. Gym. Pool. Worth it",
        "replies": [
          {
            "id": "h78xkc3",
            "content": "Their website says they are sold out of every room plan. Still searching...",
            "replies": []
          }
        ]
      },
      {
        "id": "h7zesuj",
        "content": "Well, on the bright side, some of your roommates might end up becoming your friends. Certainly one of them is gonna have word on parties and stuff and I can't stress enough how important connections are, in the business world and in real life. \n\nNo doubt that from a comfort perspective, this is a lot different from living at home and it's gonna feel awkward and uncomfortable at times. However, if you allow yourself to adjust to the situation, you might end up getting more out of it than you think.\n\nHell, once you're put in a normal dorm/apartment next year, you might miss having 8 roommates. Go into this experience with an open mind. You're bound to make a friend or two (or all of them) out of this. I'm disappointed nobody else is thinking on the bright side.\n\nThat being said, by all means, try to get an apartment. The message above is solely if all other options aren't availiable.\n\nTL;DR: Your situation really sucks on the surface. But if you can embrace the challenge, you will build resiliency and be able to tackle anything.",
        "replies": [
          {
            "id": "h81xfdn",
            "content": "I'm sure it will be fun for the first few weeks, and that would be all fine and dandy. However, since I've posted this I have talked to UR on the phone and in emails. They all say I will be in the room for the duration of the academic year. I've heard some rumors saying that we will be on the basement level, there will be no showers on the floor, bunk beds only. \n\nPurdue has really tried to shove this all under the rug. I read a PE article about the auxillary housing situation yesterday and it claimed that \"quad plus is a sort of temporary space ... they will be moved out during the semester.\" Not only is this completely untrue, people seem to be buying it.\n\nI've heard of people having bad roomate experiences with only 1 person. I can't imagine how bad it could be with 8. To add to the fire, I have classes everyday at 7:30 AM, meaning I will be having to wake up before 7:00 AM everyday. It will be an absolute maricle if I'm able to get a sufficient 8 or even 7 hours of sleep with the other guys doing shit in the room.\n\nOverall, I hope the experience is good, and I don't think it will be as bad as it sounds. I'm just sick of being absolutely shit on by Purdue at this point. Every bit of news I get is ALWAYS the bad and NEVER the good. I've yet to even step foot on campus and I'm already having to deal with bullshit like this. Unbelievable",
            "replies": []
          }
        ]
      }
    ]
  },
  {
    "title": "Safety Alerts on Campus",
    "selftext": "As we've all probably heard by now, a student was killed last night in McCutcheon residence hall. I have to say, I'm really curious as to why we didn't receive any sort of alert for this. Timely alerts are required on our campus, yet there wasn't one sent out last night. I realize there are still plenty of unknowns surrounding the situation, but that's the entire purpose behind a timely warning. The Purdue community is being told we're safe, and while I believe that, a timely warning would have been a proper supplement to alert us of the incident. \n\nAny thoughts on this?",
    "id": "xwbkkf",
    "comments": [
      {
        "id": "ir5oblr",
        "content": "A safety alert is usually to alert students of an active threat that could harm them (think about the BB gun incidents of last year). While there was an extremely violent and tragic incident, the grater campus community wasn’t in harm. A safety alert at 1 AM over an isolated incident would have probably caused mass panic and more harm than good.",
        "replies": [
          {
            "id": "ir6mcv8",
            "content": "Did they ever catch the BB bandit",
            "replies": []
          }
        ]
      },
      {
        "id": "ir5hp17",
        "content": "This is a different situation than a typical safety alert in my opinion. \n\nFor one the suspect called the police on himself. Which means PUPD knew that there wasn’t multiple suspect. \n\n2. My guess is there are a lot of procedures in a situation like this. It was an isolated incident vs something like a shooter walking around on campus. My opinion, but I don’t think this is something you rush to slap together an email. If they hadn’t had the guy in custody I GUARANTEE we would have gotten an alert asap.",
        "replies": [
          {
            "id": "ir5juze",
            "content": "Agree, and to send something like an Amber alert out, with little information known at the time, would cause even more panic",
            "replies": [
              {
                "id": "ira2dov",
                "content": "I believe amber alerts are specifically for cases of kidnapped children. I could be wrong though\n\nEdit: a quick google search says it is for kidnapping cases, usually children",
                "replies": [
                  {
                    "id": "iraqdln",
                    "content": "Yes, I know. I said, \"something like an amber alert\"",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "ir5sj8y",
        "content": "There was no danger to the community at large. Horrible event, but the suspect is in custody. If they were not, I’m sure we would’ve gotten an alert.",
        "replies": []
      },
      {
        "id": "ir5k7hi",
        "content": "You don’t really need a notification for this. Suspect is already in custody. They made a statement when they went into the office this morning at 6 which is perfectly reasonable. Warnings are meant for situations that can progress not situations that have been resolved.",
        "replies": []
      },
      {
        "id": "ir5ynyh",
        "content": "There was no threat to anybody else, so it makes sense. Mass safety alerts can cause mass panic, confusion and make things worse if they're not required. You're all finding out now, but what actions would people have taken if they knew as soon as possible last night?",
        "replies": []
      },
      {
        "id": "ir67r4t",
        "content": "\nMany, if not most, students would've been sleeping when this happened. Even if an email were sent out earlier, most students still would not have seen/heard the news until they woke up in the morning. Sending out an emergency alert, potentially waking most of the community up, to inform them of this tragic loss when there was absolutely no ongoing threat would not have been an appropriate use of an emergency alert since there was no ongoing emergency.  It would've likely created far more panic than what occurred when people woke up in the morning to this news. \n\nI find it really sad to see how many people are complaining about not finding out immediately (not just on this thread or Reddit).  This is the type of event that is going to cause some anxiety, panic, etc. regardless of when you and/or your family find out. We don't need to take that out on people who have been working hard to manage this situation. \n\nAt the time of this incident the police had more important things to worry about then informing the student body (I am certain that they would have if there was any ongoing threat). As for university officials, they'd have likely been asleep when this happened. It would take a bit longer than if this happened during business hours to make contact with them, update them, etc. I am sure that more than one person would be involved in drafting and approving the communication and that would take more time in the middle of the night.  They also needed to make sure that they had the facts right, that the victim's family was notified, etc. before sending out communication. All of this takes time. It is better that they get it right, then rush and get it wrong.",
        "replies": []
      },
      {
        "id": "ir5n3un",
        "content": "Most likely because it was an isolated incident, and he was in custody in a relatively short manner of time. \n\nWe don’t have the full details, but if the dude was still in his room, no one would know what happened till they got inside. Purdue can’t issue a warning for something they don’t know about. (It can do more harm then good to panic people, without giving proper details)\n\nAlthough not equivalent, you’d have about the same information as hearing my roommate yell sounding terrified in his sleep, “help me, get away”.",
        "replies": []
      },
      {
        "id": "ir62mwo",
        "content": "This was answered in the press conference with the chief. She said the officers where there in a fast enough manner and had the suspect in custody so there was no threat to the community so no alert was necessary",
        "replies": []
      },
      {
        "id": "ir5o0xo",
        "content": "Not only is the suspect already in custody, he reported his own crime to police. They were not perceived as a threat to others and his location was known. There was no reason to send a push notification out to 50,000 people in the middle of the night about something that causes anxiety and doesn’t help authorities handle the situation.",
        "replies": []
      },
      {
        "id": "ir5nzd1",
        "content": "International parents heard the news before students on campus.  Without details.  How terrifying for them.",
        "replies": [
          {
            "id": "ir5pkfw",
            "content": "This, this is exactly why I ask this question. Without a doubt, I think people in these comments make good points, but this is what's unsettling for me",
            "replies": [
              {
                "id": "ir73wzx",
                "content": "I think it's likely because of timezones I figure; more international parents were awake or at least actively browsing the internet to see the news break at that time of night.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "ir6c21k",
        "content": "Police had him in custody within 5 minutes of arriving on scene (per radio traffic).  There was no active threat to the university community.  You don't use the campus emergency system to let people know of headlines that would only be on the local news at 10pm in most other cities.",
        "replies": []
      },
      {
        "id": "ira45zv",
        "content": "While I agree that it wasn’t an active threat (as no one else got injured), I don’t think somebody turning themselves in over the phone is substantial evidence that they won’t go next door to potentially hurt someone else. At the very least I believe Purdue had an obligation to let people know to lock their doors because a potentially dangerous person is in the building. The police may have come quickly, but unless they just happened to be right outside the building when the suspect called, this wasn’t the time to be thinking what kind of panic would ensue if an emergency text was put out. If the suspect called the police and then changed his mind and went around on a spree with nothing to lose, it would have been even more tragic than it is now.",
        "replies": [
          {
            "id": "ira4z8z",
            "content": "Yeah, this was my thinking behind what happened. I was worried about them actually catching the suspect.",
            "replies": []
          }
        ]
      },
      {
        "id": "ir7xs2e",
        "content": "As someone who was on campus during the Andrew Bolt tragedy, the system can cause more confusion than benefit. Everyone got an alert to \"shelter in place\" but a lot of campus didn't know what that meant. There should have been an email or something to students, but an emergency alert would be too extreme.\n\nOff topic - I saw on TikTok someone said something about living 2 blocks away and finding out what happened in their 8:30 lecture, trying to get sympathy or something?",
        "replies": []
      },
      {
        "id": "ir6osm1",
        "content": "You’ll come to find Purdue hides a lottttt of shit. TA stabbing in 2017, Kid jumping off the hub in 2019 i think maybe 2020. Shooting at the hub sometime around then too…..",
        "replies": [
          {
            "id": "ir7wvun",
            "content": "Sources for any of these?",
            "replies": [
              {
                "id": "ira9bvl",
                "content": "stabbing in 2014, not 2018: https://www.latimes.com/nation/la-xpm-2014-jan-23-la-na-nn-purdue-shooting-suspect-charges-20140123-story.html\n\nThe hub shooting: https://www.jconline.com/story/news/2019/09/16/no-arrest-no-suspect-after-2-shot-west-lafayette-high-rise-roof-pool-near-purdue/2339299001/\n\nHub suicide: https://www.jconline.com/story/news/2018/09/24/purdue-students-10-story-fall-window-hub-ruled-suicide/1410245002/",
                "replies": [
                  {
                    "id": "irag7z3",
                    "content": "Yeah I was on campus for the stabbing. That wasn't really hidden...",
                    "replies": [
                      {
                        "id": "iragd7a",
                        "content": "Im just giving precious examples of stuff in the last like 3 years that isn’t heard of anymore. I can’t predict the future of how quickly this will be covered",
                        "replies": [
                          {
                            "id": "irahd6k",
                            "content": "Precise* and I don't think any of these things are \"covered\" they just fade away. The suicide was a suicide, nothing more. The shooting, the guy was caught from what I read. Most places report at the beginning, maybe something when someone is caught, then move on to the next story. It isn't just Purdue",
                            "replies": [
                              {
                                "id": "irahylr",
                                "content": "I mean sure the stuff happened and faded away but the point is purdue doesn’t do anything about it. CAPS didn’t improve after the suicide - there is still probably a ten year wait to get a meeting, I’m just saying that like they don’t do enough to make this stuff seem important so they just let it slip away. Also super petty of you to correct my grammar when you knew what I was saying",
                                "replies": [
                                  {
                                    "id": "iraj6hx",
                                    "content": "Precious and precise are completely different words. It's not like I'm correcting your, you're or their, they're, there. I would agree with you on them not doing enough for people at the school after the fact though. It seems from the outside like they just want to check boxes of \"we offered support\" or \"it wasn't actually on our campus so we don't have to do anything\". But at the same time you have to wonder what they could actually do to improve",
                                    "replies": []
                                  }
                                ]
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "ir5udk5",
        "content": "I feel the exact same way. While yes, there was no threat of any other harm because the suspect was already in custody, I heard from my father who asked if I was okay, because he saw an online post about it. I think that is completely unacceptable, and that we should have been made aware of the situation as soon as possible. It freaked me out, I was confused and scared and now I’m frustrated that there was no alert or message or email before my parents told me what happened. With a university of this size and with the funding they have, there should have been some sort of alert of the situation",
        "replies": [
          {
            "id": "ir7i5cy",
            "content": "That's unfortunate but now think of the mass panic a mass text would have caused.",
            "replies": []
          },
          {
            "id": "ir6asz9",
            "content": "Let's just say the university sent an email out right away. How would the many students that were already sleeping know to wake up and read the email? They wouldn't. Any parents that woke up before their kids and checked the news (or other sources) would still have found out first.\n\nAn emergency alert, that would've resulted in an alarm that woke students, would not have been appropriate given that there was no ongoing threat. I just don't see what anyone could've done differently to prevent some parents from hearing about this before their kids at Purdue.",
            "replies": []
          }
        ]
      },
      {
        "id": "ir62mn1",
        "content": "The guy who called in the killing was the one who did it. I can't stress how incredibly smart it was for them not to send the alert out as soon as they got the call. The alert would have created a panic and slowed down the campus security is making the environment safe again. They surrendered inside the closed dorm room over the phone and did exactly what was told of him. Why start up the panic that late at night? The panic could've freaked out the exchange student who gave himself up in his roommates death. They also had him in handcuffs within minutes so I would assume 15 minutes max. Also, if I still lived in the dorms, I would rather wake up to that message from the university. I would feel safer knowing I slept through a potential murder on campus.\n\nLowkey, I'm hoping for a juicy conspiracy story of the exchange student being an international spy from Korea and the roommate found out too much. If there is a thread for conspiracy stories someone please share. \n\nPs. If that was uncalled for I am sorry, wasn't trying to offend anyone I'm just a conspiracy hoot",
        "replies": [
          {
            "id": "ir70oc6",
            "content": "Too soon.  Where is your judgement",
            "replies": []
          }
        ]
      }
    ]
  },
  {
    "title": "Purdue Room and Board Rates (1994)",
    "selftext": "",
    "id": "xn9dxe",
    "comments": [
      {
        "id": "ipsp4gj",
        "content": "My rate hasn’t changed",
        "replies": [
          {
            "id": "ipsqz1l",
            "content": "You sure? Average rate now is twice what’s on this page. These rates are for the entire year, not the term",
            "replies": [
              {
                "id": "ipsra2m",
                "content": "Ahh, was gonna say i’m paying like $4000, but I wasn’t paying attention didn’t see it say a year.",
                "replies": []
              },
              {
                "id": "ipuxnm4",
                "content": "It’s crazy these rates haven’t changed since I went there 15 years ago.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "ipvvc8t",
        "content": "My dad paid $3.75 a day in 1980-81 for a double with a private bath in grad house and then they got billed monthly for foods. And also once a week a maid cleaned their bathroom and bedrooms. And I did the math and the same room is around $22/day and damn college prices though.",
        "replies": []
      },
      {
        "id": "ipujmej",
        "content": "The only thing that is the same is the minimum wage.",
        "replies": [
          {
            "id": "ipw9rsa",
            "content": "Except that is isn’t.\n\nMinimum wage in 1994 was $4.25",
            "replies": [
              {
                "id": "ipwecoa",
                "content": "Ok correction.  But it’s still only 7.25 now since the mid00’s.  That’s still way low compared to what students have to pay now for housing.",
                "replies": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Construction for a new res hall for grad students near McCutcheon approved",
    "selftext": "[https://www.purdueexponent.org/campus/article\\_02dca56e-1b75-11ee-8e77-f7b3bc65ddd2.html](https://www.purdueexponent.org/campus/article_02dca56e-1b75-11ee-8e77-f7b3bc65ddd2.html)",
    "id": "14rseb9",
    "comments": [
      {
        "id": "jqu25wj",
        "content": "how bad is the housing crisis for grad vs undergrad?",
        "replies": [
          {
            "id": "jqub1jz",
            "content": "on problem new grad students experience is that a lot of housing is gone by the time they’re admitted. for instance, i did my undergrad at purdue and applied for grad school, but i didn’t find out i was admitted until january and didn’t hear back from my other schools until april. housing is *very* scarce by that point.",
            "replies": [
              {
                "id": "jqubraz",
                "content": "Same here. I was accepted to my grad program in February and decided to come here in mid-March. By then the housing options were so limited and I was so desperate that I signed a lease before I even officially committed to Purdue.",
                "replies": [
                  {
                    "id": "jqucodz",
                    "content": "that’s bold! i guess you could’ve counted on another grad student needing a sublease, haha. i did not end up committing to purdue - i loved my four years here, and would’ve loved two more, but got a better opportunity elsewhere. i hope you enjoy it, and good luck!",
                    "replies": []
                  }
                ]
              },
              {
                "id": "jqvt0br",
                "content": "I was at Purdue for my undergrad and signed in December for housing before I was admitted. Worst comes to worse, I thought I would sublease to another grad student.",
                "replies": []
              }
            ]
          },
          {
            "id": "jqu3ntu",
            "content": "[deleted]",
            "replies": [
              {
                "id": "jqu465a",
                "content": "I thought it would be worse for grad students.\n\n[https://www.purdueexponent.org/campus/article\\_4059dd7f-9256-5c02-a1b4-bef8385ba3d3.html](https://www.purdueexponent.org/campus/article_4059dd7f-9256-5c02-a1b4-bef8385ba3d3.html)",
                "replies": [
                  {
                    "id": "jqu519t",
                    "content": "Let's just say it's bad for *all* the students.",
                    "replies": [
                      {
                        "id": "jqu8fcs",
                        "content": "Agreed.",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "jqx18u2",
        "content": "&gt; 690-bed graduate student housing building permit approved\n\n 690?  Nice",
        "replies": [
          {
            "id": "jqx5rhu",
            "content": "Yeah, I had a feeling people were going to joke about that.",
            "replies": []
          }
        ]
      }
    ]
  },
  {
    "title": "LPT: Even if your car wasn’t towed last game day, it could be today, check your car to make sure it’s still there/ticket-less",
    "selftext": "Last Thursday I wasn’t towed from my normal Residence Hall parking spot on 3rd St. in front of Hilly, but I woke up to three band buses taking up the spot my car used to sit in. Ended up walking 15 minutes in the rain to the Discovery Park parking lot to my car, with an at least $35 ticket (plus towing fees).\n\nI thought I was good because my car wasn’t in any of the roads warned about last game, but I guess not. I’ll be parking in McCutcheon from now on I suppose.\n\nAlso, my ticket is near-disintegrating because of the rain, so better to check sooner rather than later.\n\nBoiler up?",
    "id": "9e5gvm",
    "comments": [
      {
        "id": "e5mi4w9",
        "content": "I was driving home at 6am today and got a sneak peak at PUPD having a field day rounding em all up. They're ruthless. ",
        "replies": [
          {
            "id": "e5mldmh",
            "content": "Yeah, I’m totally cool with having spaces designated for game traffic or whatever. I just never saw that sign until like very-much-after 6 a.m. today. When do they post those?\n\nAlso, there should be some requirement of lamination for signs and tickets when it’s raining. So I can actually read the signage telling me when not to park somewhere.",
            "replies": []
          }
        ]
      },
      {
        "id": "e5muhwv",
        "content": "Black_man_pointing_at_head.png:  “don’t have to pay parking ticket if it disintegrates”. ",
        "replies": [
          {
            "id": "e5n1upk",
            "content": "I always just throw my Purdue tickets away. most of the tickets I've gotten never ended up on my account for some reason, so I just never had to pay them. I've only actually had it put a hold on my account for non-payment once.",
            "replies": []
          }
        ]
      },
      {
        "id": "e5ne8o1",
        "content": "This happened to me last week except it was construction rather than band busses. Not sure when signs were posted, but I woke up to my car being towed from a res hall spot in the middle of a res-Hall-only parking lot. It was particularly odd since my car was the only one out of like 50 cars being towed. Almost as if they chose one at random to tow for the construction workers. They claimed they tried to contact me, but I was not contacted ever. I will try to appeal it, but know I will lose.",
        "replies": []
      }
    ]
  },
  {
    "title": "Rank the 5 dining halls",
    "selftext": "Figure I do a little experiment of sorts here.\n\n&amp;#x200B;\n\nFor the record, I have been to only 4 of the 5 dining halls here on campus. The only one I have not been to is Ford. So, Ford will not be in my rankings.\n\nFrom best to worst.......\n\n\\-Windsor\n\nWarm and cozy atmosphere. Not always too busy. Plenty of seating. Great food and is on my way from most of my classes. I typically eat here for lunch. \n\n&amp;#x200B;\n\n\\-Wiley\n\nThis ranks pretty close to Windsor. It has a nice atmosphere and good food. But, for someone who lives in a place like McCutcheon (like me), you would be going a bit out of your way. Especially when it is more convenient to go to a dining hall that is on the path of where you need to go. \n\n&amp;#x200B;\n\n\\-Earhart\n\nNow this is a list based solely on my opinions. Earhart is the second closest to McCutcheon. It has atmosphere. Plenty of seating. But, the one thing that brings this down is the food. Had a bad experience with the Chorizo and Eggs that I had for breakfast. Enough said.\n\n&amp;#x200B;\n\n\\-Hillenbrand\n\nHillenbrand maybe the closest to my dorm but it is at times, a royal pain in the ass to get into. Always packed. It lacks atmosphere and the only thing that I find worth getting is the chicken for dinner.\n\n&amp;#x200B;\n\nI will note that Ford is way too far away from McCutcheon and on no occasion would I find myself going out of my way to get food when it would be easier to get something to eat at Windsor.",
    "id": "pjq17z",
    "comments": [
      {
        "id": "hc42rck",
        "content": "Ford, Earhart, Windsor, Wiley, Hilly",
        "replies": []
      },
      {
        "id": "hc4rjhn",
        "content": "Earhart, Hilly, Windsor, Wiley, Ford",
        "replies": []
      },
      {
        "id": "hby5cia",
        "content": "[deleted]",
        "replies": [
          {
            "id": "hc0p24r",
            "content": "I only ate at Ford twice, as a graduate student. I love the pizza, make-your-own-burger, and cherry dream (no idea what it is).",
            "replies": []
          }
        ]
      },
      {
        "id": "hc09bdo",
        "content": "[deleted]",
        "replies": [
          {
            "id": "hc24xh1",
            "content": "In my opinion \n\nFord and Willey have the best food but Ford is always too far away and Willey is always packed \n\nWindsor is next best in food (has that awesome panini press) and has a great atmosphere while never being crowded \n\nHillenbrand and Earhart are close but there food can be spotty. \n\nSo it all depends on where I am and what time of day it is.\n\nDistance 3 -Hill ans Ear 2 -Windsor and Willey 1-Ford \nFood 3-Ford and Willey 2- Windsor and 1-Hill and Ear\nPeople 3-Windsor 2-Hill, Ear, and Ford 1-Willey \n\nFinal rankings Windors (7) everybody else is a (6)",
            "replies": []
          }
        ]
      },
      {
        "id": "hc0ozp1",
        "content": "What do you recommend I must eat from the dining halls? I'm a graduate student so I have no experience living on campus.",
        "replies": [
          {
            "id": "hc1whfk",
            "content": "It's all you can eat and 9 times out of ten the food slaps",
            "replies": []
          }
        ]
      },
      {
        "id": "hcottqe",
        "content": "Wiley, Earhart, Hillenbrand, Windsor, Ford",
        "replies": []
      },
      {
        "id": "hbyn5cq",
        "content": "Wiley, HillyB, Windsor, Ford, Earhart",
        "replies": []
      },
      {
        "id": "hbzp7n5",
        "content": "Earhart, Windsor, Ford, Hillenbrand, Wiley. \nEarhart/Windsor/Ford…food is just ok/not great but what makes them the top 3 is the employees! They are very friendly and nice. I actually prefer Wiley food but i hear the employees yelling a lot and they are just plain rude to customers. Hillenbrand food is not good and employees work like zombies.",
        "replies": []
      },
      {
        "id": "hfq5p74",
        "content": "Ford, Hillenbrand, Wiley, Earheart... windsor",
        "replies": []
      }
    ]
  },
  {
    "title": "Which Residential Hall and learning community should I apply to?",
    "selftext": "Hey!,\n\nI just accepted my offer to Purdue for Computer Science but I can't pick a residence hall or learning community. I want to socialize and make good friends so I am looking for a hall with a lot of freshmen. The CS learning community is based in McCutcheon for men but i read online that it has very small rooms etc. \n\nI am confused between joining the CS community and going to McCutcheon or joining the data mine in Hillenbrand.\n\nI have chidi from the good place level of indecisiveness so please help me out.",
    "id": "ts9t5g",
    "comments": [
      {
        "id": "i2qgckm",
        "content": "Try doing the data mine, especially corporate partners. adds to ur resume a bit and could help with getting in internship (helped me). \n\nIt’s based in hilly, where I live right now. It’s honestly not too bad, there’s a dining court right below so I get food in shorts while everyone else dresses for the snow. There’s also a bus stop right in front that takes u to main campus. Only bad part is the bathrooms are split between 4 and get cleaned only once a week.",
        "replies": [
          {
            "id": "i2r9rl1",
            "content": "Agree! I was in the Data Mine back before Corporate Partners got huge and I have to say it’s a great cohort for gaining experience. I’d say the bathroom situation in Hillenbrand is *far* better than having a communal bathroom in any other dorm. Go with Data Mine.",
            "replies": []
          }
        ]
      },
      {
        "id": "i2qjhvx",
        "content": "&gt;I have chidi from the good place level of indecisiveness so please help me out.\r  \n\r\n\nthis is 100% me too lol i'm between wisp lc and cs lc",
        "replies": [
          {
            "id": "i2sj8ps",
            "content": "BRUH me too i literally am pushing off this decision until april 15th i srsly do not know. I love WISP dorms and environment but grades are super important for me and i heard the cs lc helps with keeping up in classes cause everyone on ur floor takes the same classes, also the career fairs are a plus. lmk what u decide cause i have no idea😭😭",
            "replies": [
              {
                "id": "i2sptrm",
                "content": "uh- i read the first half and was gonna ask you what u were gonna pick and then i read the last part 😭",
                "replies": []
              },
              {
                "id": "i2sq2of",
                "content": "honestly idk because i know the cs llc has stayed at earheart for the last few years and i like wisp's dorms a lot more and being comfortable is a priority for me, but i'm also worried about managing living on my own as well as keeping up with classes so it might be nice to have help with at least classes at the cs llc.",
                "replies": []
              }
            ]
          },
          {
            "id": "i2r8kqj",
            "content": "I would recommend WISP! They have monthly events and you get to live in Meredith South which is one of the newer, nicer dorms :)",
            "replies": []
          }
        ]
      },
      {
        "id": "i2qlvml",
        "content": "I'll only speak from the residential side of things since I'm not in either LC.\n\nHillenbrand is better. The rooms in Hillenbrand are bigger and you only share your bathroom with 4 people instead of the whole floor.\n\nI live in McCutcheon.\n\nDM me if you want pics",
        "replies": [
          {
            "id": "if8mdix",
            "content": "Hey this was a while ago and I'm a freshman but I wanted to ask you, are learning communities required?",
            "replies": [
              {
                "id": "if8x9aj",
                "content": "Nope, I was in McCutcheon and wasn't part of any learning community.",
                "replies": [
                  {
                    "id": "if8zyum",
                    "content": "damn I see\n\nthey put apply to be in a learning community in the new purdue student task list\n\noh well\n\nif you could go back, would you apply for a learning community though?",
                    "replies": [
                      {
                        "id": "ifba7s3",
                        "content": "I don't think I can answer that question. I never felt like I missed out on anything because I wasn't in an LC, but realistically I wouldn't be aware of any opportunities unless I was in an LC to begin with.\n\nI have a lot of friends in Data Mine, and it seems like good experience and would help with internships and stuff, but you don't strictly need to be in an LC for it (LC's just make it easier). Plus, it seems like a lot of work. \n\nSo, the only knowledge I have of LCs is 3 friends in Data Mine, and based on that, personally I wouldn't apply, but I don't know what I'm missing out on, so not really the best source on this.",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "i2reyat",
        "content": "Corporate partners data mine looks real nice on a resume and hillenbrand is one of the nicest dorms overall (space and private bathrooms)",
        "replies": []
      },
      {
        "id": "i2qcznj",
        "content": "Mccutcheon is super far from all the academic buildings. Hillenbrand is also super far from all the academic buildings. Hillenbrand has a dining court though so you won’t necessarily have to brave the freezing temperatures to eat.",
        "replies": [
          {
            "id": "i2qjyq8",
            "content": "Super far as in only 1-2 minutes farther at most. It's not that bad, jeez.",
            "replies": [
              {
                "id": "i2qnu5n",
                "content": "Yeah if you’re going by marginally farther away it’s only a couple minutes farther but it’s still a 15-20 minute walk lmao pretty far if you’re not taking a bus and the sidewalks are all frozen over",
                "replies": [
                  {
                    "id": "i2qpwet",
                    "content": "I meant compared to other residential halls. I walk from harrison and it only takes me 2 minutes max to get near meredith area. Cary area would be more like 3-5 which I suppose is what you are talking about.\n\nStill, not a deal breaker though, even if it's snowy slushy frozen sidewalks (at which point you really should just take the bus).",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "id": "i2qdqoo",
            "content": "Cary is also good for this too because of Ford, but ONLY if you are in a single. Cary doubles are terrible",
            "replies": [
              {
                "id": "i2qz6gp",
                "content": "Don’t forget about semi suite doubles though. Unlikely that a freshman will get them but it’s definitely possible.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "i2qey34",
        "content": "McCutcheon is good because it’s quiet. I lived there all of freshman year and sophomore up until we got sent home because of the pandemic, and the room sizes are manageable. I’d recommend coordinating with a roommate if you go there to loft at least one of your beds to increase the usable space in the room though",
        "replies": []
      },
      {
        "id": "i2qohec",
        "content": "Current CS LC member and McCutcheon resident here. As far as I’m aware, most of the LC residents are placed into converted triples (double sized room with 3 people) this year. I don’t mind it, since my roommates are usually gone and I don’t need much space, but it could be an issue for some people. I appreciate having other CS majors as roommates so we can discuss current work/study for midterms together, but you could probably get a similar experience just by making friends within your major. The CS LC events are mostly optional, but I have heard Data Mine has required classes associated. I enjoy the LC, but I wouldn’t recommend it for everyone",
        "replies": []
      },
      {
        "id": "i2rl560",
        "content": "If you're deciding based on the dorms, you can go to this website and look at room layouts, amenities, and pictures!\n\nhttps://www.housing.purdue.edu/my-housing/options/residence-halls/index.html",
        "replies": [
          {
            "id": "i2rldco",
            "content": "You can also find virtual room tour videos for most of the dorms on youtube!",
            "replies": []
          }
        ]
      },
      {
        "id": "i2wvd08",
        "content": "mccutcheon had standard sized rooms! they actually have the largest closets out of all of the res halls :) I loved mccutcheon, it’s air conditioned, the community there is great, and the rooms are nice! i lived there when it was co/ed and it’s def one of my fav places on campus!!",
        "replies": []
      }
    ]
  },
  {
    "title": "Remove top shelf desk in McCutcheon hall?",
    "selftext": "I wanted to bring a big monitor for Purdue, but I need to remove the top shelf on my desk. Is it removable in McCutcheon  hall? And how do I remove it?Does Purdue allow you to remove it so long as you put it back before the end of semesters?",
    "id": "cp6ufm",
    "comments": [
      {
        "id": "ewnlnn3",
        "content": "There are two hex bolts to undo on the bottom of the desk, then it just comes off.  I recommend using as a shelf in the closet.  As far as I know, they don't care as long as you put it back.  I have done it the past two years and haven't had anyone say anything",
        "replies": [
          {
            "id": "ewnms52",
            "content": "Its great to hear that about McCutcheon hall! Do you know if it is possible to move the desk under my bed loft instead of beside it?",
            "replies": [
              {
                "id": "ewo9xbf",
                "content": "Yeah, if it's lofted you'll have plenty of space underneath for sitting at your desk. The only thing to consider is you may hit your head while standing up.",
                "replies": [
                  {
                    "id": "ewoomef",
                    "content": "Thanks for the tip! Its great to hear that dumb desk and top shelf is moveable",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "id": "ewu4ori",
            "content": "Would you happen to know if you can remove the shelf in Third Street Suites?",
            "replies": []
          }
        ]
      },
      {
        "id": "ewnldy3",
        "content": "If it's like the same as the Cary Quad South desks, the top part of the desk just sits on pegs. You could always remove it and put it somewhere, and like as long as you don't damage it, I don't think you'll be charged for doing that.",
        "replies": []
      },
      {
        "id": "ewocrnh",
        "content": "You can do whatever you want with it. But you got to store it in your room. You will be charged if you take it out of your room to store",
        "replies": [
          {
            "id": "ewones4",
            "content": "Do I need to run this by my RA or can I just do it willy nilly?",
            "replies": [
              {
                "id": "ewonkai",
                "content": "Im sure you can do it without notifying them. But make sure you can store the shelf somewhere in your room.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "ewoelvz",
        "content": "I am surprised they are still using that old furniture. I had to do the same thing to my desk many years ago. \n\nIn any case, yes, just remove it and store it somewhere out of the way.",
        "replies": []
      }
    ]
  },
  {
    "title": "How thick are the mattresses in McCutcheon Hall and should I get a mattress topper?",
    "selftext": "I'm trying to buy bedsheets right now, and some of the bedsheets say \"8 to 16 inches\" etc etc",
    "id": "wcrkfu",
    "comments": [
      {
        "id": "iie63ti",
        "content": "Get a mattress topper trust, there’s some good ones for like 50 bucks at walmart",
        "replies": [
          {
            "id": "iie6elc",
            "content": "it should be twin size, right?",
            "replies": [
              {
                "id": "iie7af4",
                "content": "We got a twin XL 3 inch mattress pad. Using a XL mattress cover &amp; twin XL sheets it worked great.\n\nThe mattress is in between lengths of a twin &amp; twin XL",
                "replies": []
              },
              {
                "id": "iie6gxt",
                "content": "Yeah I’m pretty sure",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "iie84ja",
        "content": "You can always get one after you movie in, might try it out first and see if you think you need it.  They are definitely cheap mattresses, but I didn’t think they were particularly uncomfortable",
        "replies": []
      },
      {
        "id": "iieg1hz",
        "content": "Yes",
        "replies": []
      },
      {
        "id": "iiejj40",
        "content": "Mattresses at UR residence halls are twin sized (whatever that means). I’d say the mattresses are not that thick; maybe about 6 inches at most iirc. \n\nThose sheets should do fine, especially if you have a mattress topper. The one I have is a memory foam mattress pad, which is about 2-3 inches thick. I’d also get a mattress protector, especially if you sweat while you sleep.\n\nSo, yeah. Those sheets should work.",
        "replies": []
      },
      {
        "id": "iig3r9r",
        "content": "Actually they are sooo thick. Best mattress money can buy.",
        "replies": [
          {
            "id": "iig581z",
            "content": "They are indeed the best mattresses ever, it’s like sleeping on a comfy rock",
            "replies": []
          }
        ]
      },
      {
        "id": "iiejvnc",
        "content": "I had a 3 in topper my freshman year, and it gave me back problems. I went without one the next year and was fine. I prefer a slightly firmer mattress though.",
        "replies": [
          {
            "id": "iifpcz5",
            "content": "Same \n\nGot rid of it three months in and it greatly helped",
            "replies": []
          }
        ]
      },
      {
        "id": "iifa9bo",
        "content": "they have an odd quilted texture and are pretty slick so I just got a thin one. I like firmer beds",
        "replies": []
      },
      {
        "id": "iigeas6",
        "content": "Highly recommend the Room Essentials Jersey sheets from Target. So comfy and worked with my 3” memory foam topper (seriously, if you’re going to splurge on one thing, make it this) perfectly!",
        "replies": []
      },
      {
        "id": "iii9i9r",
        "content": "I have two mattress toppers and still wake up with neck cramps every morning :|",
        "replies": []
      }
    ]
  },
  {
    "title": "Mccutcheon Elevator",
    "selftext": "Are there elevators at Mccutcheon Hall? I live on the 7th floor now apparently and I want to know how difficult it'll be to move in.",
    "id": "wnu7ik",
    "comments": [
      {
        "id": "ik7cg15",
        "content": "Yes there are. I lived on the 7th floor of McCutcheon last year.",
        "replies": [
          {
            "id": "ik7cohm",
            "content": "Thank you so much!",
            "replies": [
              {
                "id": "ik7d1n3",
                "content": "You’re welcome. Also, I’m always happy to answer any further questions you have about McCutcheon.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "ik7bwqa",
        "content": "Hey I live in the 7th floor of Mccutcheon as well",
        "replies": []
      },
      {
        "id": "ik7lazm",
        "content": "Buddy of mine said there are 2 elevators for each tower",
        "replies": []
      },
      {
        "id": "ika158w",
        "content": "Yeah there are. It’s a bit tricky to move all of your stuff in. You need to go back near the loading dock and go through a door there, then you’ll walk down the hall of the first floor and eventually reach  a set of doors that leads to the elevators",
        "replies": []
      },
      {
        "id": "ikb93sd",
        "content": "yes but they break every other day💀",
        "replies": []
      }
    ]
  },
  {
    "title": "Should I get a bike?",
    "selftext": "I am living in McCutcheon hall and I have lots of early classes across campus (Including a 7:30 ENGR 131). Is a bike a worthy investment for traveling across campus?",
    "id": "155alnn",
    "comments": [
      {
        "id": "jstsvyf",
        "content": "Yes. I biked everywhere for my 4 years. When I moved off campus, bike chained to a rack near co-Rec parking lot.",
        "replies": []
      },
      {
        "id": "jsutn7x",
        "content": "If you get a bike, either get something cheap so you won't feel bad about it getting dinged and rusting, or get something that is worthy of your time, money, and effort for the next few years. Regardless of whichever route you go down be mindful of how and where you lock your bike.\n\nCampus is bike friendly and most of WL is as well so you will probably get more use than simply going to class.",
        "replies": []
      },
      {
        "id": "jsv6ok6",
        "content": "Yes but I'll add the McCutcheon is notoriously far away from basically everything so having a bike will make getting places less cumbersome.",
        "replies": []
      },
      {
        "id": "jsvxwqr",
        "content": "Bike or electric scooter for sure.",
        "replies": []
      },
      {
        "id": "jsx4qem",
        "content": "If you do, bring a u-lock/cable lock combo",
        "replies": []
      },
      {
        "id": "jsut9ut",
        "content": "Not a new bike",
        "replies": []
      },
      {
        "id": "jsvf61y",
        "content": "Bring a bike that's not expensive and buy a very good lock and chain oil as the chains get rusty being outside.",
        "replies": []
      },
      {
        "id": "jsthrtn",
        "content": "Just take the bus",
        "replies": [
          {
            "id": "jstl0wb",
            "content": "Bruh... such a shitty lazy ass response.",
            "replies": [
              {
                "id": "jsu642o",
                "content": "Anything wrong with using the bus? I am planning on using it to get to classes.",
                "replies": [
                  {
                    "id": "jsunuq6",
                    "content": "It’s not the most reliable, although I’ve heard it’s better than other colleges",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "What’s McCutcheon hall like?",
    "selftext": "I’m in the CS LC starting this fall semester and I believe this LC’s members stay at McCutcheon. \n\nPros and cons? Fun stuff to do? Where would you rank this hall among the others? What’s the residence hall like in general? \n\nWant to get an idea about what the people and the rooms are like. Thanks! ",
    "id": "8sthg2",
    "comments": [
      {
        "id": "e123io7",
        "content": "McFucking far away",
        "replies": [
          {
            "id": "e123mc1",
            "content": "Lmao not the first time I’ve heard this, what about other than the distance? ",
            "replies": [
              {
                "id": "e12ktqj",
                "content": "As a side note, don’t worry too much about the distance. It’s not that bad. I lived in Shreve, but still always took the bus to my classes, and there’s a stop in front of Harrison/Earhart/First Street for the Sloop (Silver Loop) bus. ",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "e127zhd",
        "content": "When I lived there 6 years ago, that strip mall behind McCutcheon was perfect for Sunday dinner. It has a DQ, Papa John's, Subway, and a couple other food options. Plus, Follett's just in case. Hopefully it's still there!",
        "replies": [
          {
            "id": "e12q349",
            "content": "It is don't worry",
            "replies": []
          }
        ]
      },
      {
        "id": "e12rbvr",
        "content": "It’s just fine. People complain about the distance but it’s barely further than the others. The bathrooms are newly renovated, the rooms are air conditioned and not super cramped (relative to other dorms), and there’s nothing “wrong” with it at all. EXCEPT THAT THERE AREN’T FREAKING CARD SWIPES ON THE BACK STAIRWELLS AND YOU HAVE TO SWIPE IN TWICE TO GET IN AND ITS DUMB AS HELL. \n\nBut like otherwise a solid place to live freshman year.",
        "replies": [
          {
            "id": "e145609",
            "content": "Boy, that escalated quickly.",
            "replies": [
              {
                "id": "e14z0vf",
                "content": "I've lived in Mccutcheon for 3 years now. The fact that the outdoor stairwells don't have swipe access is incredibly infuriating.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "e129owt",
        "content": "Bring a bike unless you hold a title in some kind of speed and endurance based walking competition.",
        "replies": []
      },
      {
        "id": "e12kfqv",
        "content": "All freshman pretty much means it gets trashed s lot. Learn the bus loop schedule, you’ll thank me later.",
        "replies": []
      },
      {
        "id": "e1a9jjs",
        "content": "McCutheon is a nice and cozy hall with its own privacy compared to other halls which are clustered together. I stayed in McCutheon for freshmen year as a part of LC. The computer lab is convinient and is only accessible to people with McCutheon dorm key. The gold loop stops in front of you and can drop you to the cs building (lawson) and there is 4B for walmart nearby and so is silverloop leaving from earhart. In winters is when you will have the problem, because the nearest dining courts are like 5 min walk Hillenbrand and Earhart. So thats a pain in the snow, however there is a korean restuarant, papa johns, hungrys DQ, and subway right across mccutheon drive. There is follets right across in case you need some pens, books etc and sometime they have basic groceries too. McCutheon has a coffee/playroom at the bottom also has a large study area next to the  reception . The washroom privact is limited by curtains and these are public washroom so each floor has a set of washrooms. But mens and womens washrooms are on different floors.",
        "replies": []
      },
      {
        "id": "e1451pd",
        "content": "I'm in the CS LC too!",
        "replies": [
          {
            "id": "e16b81s",
            "content": "That’s awesome! Black or Gold? ",
            "replies": [
              {
                "id": "e16ba9l",
                "content": "gold but it's all the same. just a different CS 180 class",
                "replies": [
                  {
                    "id": "e16bcea",
                    "content": "Yeah that’s true. ",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "e15cgyg",
        "content": "You’ll enjoy your stay at MCUT ",
        "replies": []
      },
      {
        "id": "e15tv6x",
        "content": "I’ll be in the LC as a freshman too! See you in fall I guess :)",
        "replies": [
          {
            "id": "e16b7il",
            "content": "Cool! See you soon! Black or Gold btw? ",
            "replies": [
              {
                "id": "e16psod",
                "content": "Black!",
                "replies": [
                  {
                    "id": "e191sey",
                    "content": "Oh cool, me too! ",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "e3ugjyf",
        "content": "Stayed here my freshman year. I loved it. Got good exercise from walking around everywhere in the first sem but became a victim to Dairy Queen blizzards the next semester. Bathrooms are nice and clean and the study rooms are pretty great. Buses and restaurants are nearby too.",
        "replies": []
      },
      {
        "id": "e12t2ei",
        "content": "I lived in Cutch last year on the 7th floor. our floor was super fun and rowdy and people say its far away but it really isnt sloop and gold loop are right next door and dont eat at Earhart it sucks there. The walk from mcut to physics building ( im a physics major) was a 15 minute walk I just put on my headphones and walked. Most of the time you find your friends walking and you walk together to class or the walk back. The atmosphere is real nice and the nar lounge downstairs is a great fun friday, saturday and sunday evenings. feel free to ask me about any questions about the rooms. IMO all of the legacy lane dorms are the same ",
        "replies": [
          {
            "id": "e12t6ah",
            "content": "also put your desk under your lofted bed it gives you lots of extra floor space and youll thank me later. I placed my desk under my bed facing the wall so there is like a private cubicle under my bed for focused studying.",
            "replies": []
          }
        ]
      },
      {
        "id": "e136qbe",
        "content": "Pretty good. It's fairly quiet, especially compared to other dorms. The walk isn't that bad, except for a few days where it is extremely hot or walking in a blizzard. Close to eating options at Purdue West and a couple dining courts. Silver Loop stop isn't too far either. I enjoyed it. ",
        "replies": []
      },
      {
        "id": "e14yx6i",
        "content": "I'm gonna be starting my senior year this fall and will have lived in Mccutcheon all four of my years here. I love it. It's got AC, parking garage right next door, close restaurants, and the sloop/gloop run right by it. It's underrated by many. The distance helps keep away the freshman 15",
        "replies": []
      }
    ]
  },
  {
    "title": "Lost package McCutcheon Hall",
    "selftext": "Hello,\n\nI had a DHL package that was supposed to be delivered too McCutcheon Hall. The driver left it outside the hall and never gave it to the front desk. Does anyone know about a package or have seen one. Also, does anyone know what I should do? It was a StockX shipping.",
    "id": "stgvcv",
    "comments": [
      {
        "id": "hx3s4hb",
        "content": "rip, trying asking the desks",
        "replies": []
      },
      {
        "id": "hx7ptb2",
        "content": "Stolen",
        "replies": []
      }
    ]
  },
  {
    "title": "So how is McCutcheon Hall as a First Year Dorm?",
    "selftext": "Incoming Freshman with a very low effort post, thank you to anyone who responds.",
    "id": "6rpqbs",
    "comments": [
      {
        "id": "dl783jj",
        "content": "[deleted]",
        "replies": [
          {
            "id": "dl856pi",
            "content": "Much obliged.",
            "replies": []
          }
        ]
      },
      {
        "id": "dl805r6",
        "content": "McFuckinFarAway\n\nOther than that, the community was solid when I was there. ",
        "replies": []
      },
      {
        "id": "dl6vb99",
        "content": "My low effort response is it's fine. \n\nBut really, it is fine. The walk isn't that bad and since its further away it was pretty quiet for the most part. Having a lab was good. Also there is a nice flat screen in the common area that people would watch sports/whatever in. ",
        "replies": [
          {
            "id": "igtz2lx",
            "content": "&gt;pretty quiet\n\nthank god\n\nI'm an introvert and don't really like interacting with people if i don't need to. Hope it's still like that though. Even thought you commented that 5 years ago lol.",
            "replies": []
          }
        ]
      },
      {
        "id": "dl7e889",
        "content": "The only real con is that it's the farthest. But you're close to a couple dining courts and the harrison grille sooo",
        "replies": [
          {
            "id": "igtz40q",
            "content": "&gt;you're close to a couple dining courts\n\ndo most residance halls have a dining court in them?",
            "replies": [
              {
                "id": "igu0na0",
                "content": "Nope there's only 5 dining courts. But most of the dorms are within walking distance of one and I think they all fall on bus routes iirc.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "dl7cpab",
        "content": "It's far but it's nice",
        "replies": []
      },
      {
        "id": "dl7erx9",
        "content": "I live there 11 years ago. It was awesome and that was before A/C. It is my understanding that there is now A/C and other upgrades. I liked how it was close to several of the dining halls (though not the best ones) so I could get up early, do my laundry, go eat breakfast and then put my laundry in the dryer and not have to kill so much of my day.\n\nI personally liked the walks to and from campus (I rarely took the bus) so that was a big plus. The nostalgia is kicking in. \n\nOh, and I hope you like waking up at 7am on football game days... the Boilermaker Special would like to have a word with you :)",
        "replies": [
          {
            "id": "dl7f5w0",
            "content": "SHHHH DELETE THE LAST PART LET OP SOIL THEMSELVES ",
            "replies": []
          },
          {
            "id": "dl8aazh",
            "content": "Is there any dorm that isn't subject to that torture?",
            "replies": [
              {
                "id": "dl8l738",
                "content": "Of course not, but i think its worse because it echos between the towers.\n\nGod Speed, OP",
                "replies": [
                  {
                    "id": "dl9ax39",
                    "content": "I'm so not ready.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "dl7qlbm",
        "content": "I lived there last year and I had one of the greatest times ever. Make sure to meet the other people in your floor and be friendly. Is there anything in particular that you want to know?",
        "replies": [
          {
            "id": "dl830ql",
            "content": "Nah, I'm from out of state and am just hoping to settle in good. Seems like a fine dorm from what people are saying. (I hear the Carey Quads are hell)",
            "replies": [
              {
                "id": "dl84udv",
                "content": "I don't think you'll ever regret it",
                "replies": []
              },
              {
                "id": "dl84kui",
                "content": "&gt; I hear the Carey Quads are hell\n\nYou take that back!",
                "replies": [
                  {
                    "id": "dl8566u",
                    "content": "YOU LIVE/LIVED IN A FUCKING CLOSET!",
                    "replies": [
                      {
                        "id": "dl8aazg",
                        "content": "I mean that's just where the freshmen get stuck. I think Cary still has some of the biggest suites you can find on campus. 3rd Street may have taken top position but I don't know",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "dl8778v",
        "content": "I enjoyed it being more out of the way just to get away from everything. Plus the walk helped me lose the freshman 15.",
        "replies": [
          {
            "id": "dl88jvc",
            "content": "Do they even serve somewhat healthy food in the dining halls?",
            "replies": [
              {
                "id": "dl8ad70",
                "content": "Windsor has amazing salads. Go for the healthy food, go again to see Grandma Vi at OTG",
                "replies": []
              },
              {
                "id": "dl98a2z",
                "content": "Being vegan before I came to Purdue, I can say that the food honestly isn't that healthy :/ Sometimes even the best vegetarian options were french fries and pizza. I couldn't really eat a salad because being a 6'2\" guy, that doesn't really fill me up at all lol. But yeah, tbh I struggled with finding healthy options that I liked in the dining courts. I know everybody has a different experience but that was mine haha.",
                "replies": [
                  {
                    "id": "dl98bph",
                    "content": "Yeah I dropped a bunch of weight this summer and just wanna keep it going.",
                    "replies": [
                      {
                        "id": "dl98qyx",
                        "content": "Good on you!!! :) Honestly, my best recommendations are probably going to Windsor. It's not the greatest, but they always have some sort of rice dish with vegetables, and they're not bad. Also, Windsor has the sandwich station and you could make a few healthy sandwiches on some whole grain bread with some lean meats if that's your thing! Those are my best recommendations. ",
                        "replies": []
                      }
                    ]
                  }
                ]
              },
              {
                "id": "dl8lhv7",
                "content": "maybe its a bit healthier than outside food but not because they want the food to be healthy. they're just lazy to cook",
                "replies": []
              },
              {
                "id": "dl8vlce",
                "content": "Windsor is the place you go if you're feeling healthy. There's enough options in all the dining courts though. ",
                "replies": []
              },
              {
                "id": "dla8evj",
                "content": "It's dining hall food. So no. The secret is to control how much you eat and exercise it off. 3 sport athlete in HS and I didn't realize that I couldn't eat 5000 calories a day anymore so I got fat. As soon as I figured out how to eat with some restraint, I ended up losing the 50 pounds I put on.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "dlat0a1",
        "content": "It's in close proximity to ~~McDonald's~~ Dairy Queen, so there's that.",
        "replies": []
      }
    ]
  },
  {
    "title": "Freshman Parking",
    "selftext": "Can I park my car in the McCutcheon garage as a freshman? I will be staying in McCutcheon hall and will need to be to and from Indianapolis on most weekends.",
    "id": "15qkoje",
    "comments": [
      {
        "id": "jw3oiin",
        "content": "Not unless you have a residence hall parking permit, which freshman cannot get unless they qualify as a sophmore by credit. The \"restricted residence hall parking permit\" could still be an option though if you have a \"documented need to travel off campus.\" Everything you need to know about parking permits can be found [here](https://www.purdue.edu/parking/permits/students/index.html).",
        "replies": []
      },
      {
        "id": "jw4hwh1",
        "content": "You can park anywhere if you’re brave enough",
        "replies": []
      },
      {
        "id": "jw4xcg6",
        "content": "i’d call parking immediately and see what they can do. freshmen can’t have cars on campus in most cases. what is the reason you have to go to indy most weekends? there are some exceptions",
        "replies": []
      },
      {
        "id": "jw5q8cl",
        "content": "A little late to be asking",
        "replies": []
      },
      {
        "id": "jw4qir2",
        "content": "Not in your first semester. Second semester yes but it’s not a guarantee. I lived in Harrison and had to park my car on Russell St my first semester. I got lucky and got a parking pass for McCutcheon garage for spring.",
        "replies": []
      },
      {
        "id": "jw5uhyl",
        "content": "you could just play cat and mouse with purdue pd like i did my first semester",
        "replies": []
      }
    ]
  },
  {
    "title": "Feedback on McCutcheon Hall",
    "selftext": "I’m just looking for some feedback on the pros and cons of the dorm. Is this dorm coed? It certainly is far away on the southwest corner of campus so I’m guessing geography isn’t a pro. But I was interested in the quality of life in the dorm and the room sizes. Thank you",
    "id": "oppuh7",
    "comments": [
      {
        "id": "h67e8xn",
        "content": "Beyond the distance to campus McCutcheon is overall pretty nice.  The bathrooms were recently renovated compared to some of the other dorms, AC, you’re super close to the parking garage (if you’re not a freshman) and Earhart and Hilly is nearby for food.",
        "replies": [
          {
            "id": "h67ebuv",
            "content": "Is it coed?",
            "replies": [
              {
                "id": "h67f8uv",
                "content": "[deleted]",
                "replies": [
                  {
                    "id": "h67j35k",
                    "content": "Yeah I was gonna say. I lived there 2018-2019 and I’m pretty sure I have tits",
                    "replies": []
                  },
                  {
                    "id": "h67fc4r",
                    "content": "Thank you",
                    "replies": []
                  }
                ]
              },
              {
                "id": "h6crhu7",
                "content": "MCUT was coed until last year, when both towers went to all male. Also the south tower is a little nicer, they renovated the (then) women’s side a few years back, but it’s been a while since the north tower had a renovation.",
                "replies": []
              },
              {
                "id": "h67eevr",
                "content": "No, I believe both towers are male only",
                "replies": [
                  {
                    "id": "h6931tw",
                    "content": "I think they changed McCutcheon to male only just last year but I could be wrong. The housing page should say which dorms are male and female only it",
                    "replies": []
                  },
                  {
                    "id": "h67evne",
                    "content": "Thank you",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "h67bj0l",
        "content": "McCutcheon is male only last time I was there. Its about a mile away from arc, nice workout for your legs. The dorm I would say is average, the only benefit compared to the other ones such as owen or wiley would be AC. Also comes with closets and is a little bit bigger than some of the other dorms.",
        "replies": []
      },
      {
        "id": "h67i7xq",
        "content": "I just lived in McCutcheon and I really enjoyed the quiet aspect of it. All of my other friends would talk about how loud their floors were and ours were silent. Everyone respected quietness. That being said I met a ton of great people there and really had a great time. Only this is really gotta plan for classes as the commute is the longest but actually enjoyed it on most days.",
        "replies": [
          {
            "id": "igtxuuz",
            "content": "&gt; I really enjoyed the quiet aspect of it.\n\nyo thank you for that\n\nI like a quiet atmosphere and I'm an introvert so McCutcheon Hall seems like a really good residence hall for me.\n\nDo you recommend bringing a bike to get to classes though?",
            "replies": []
          }
        ]
      },
      {
        "id": "h67lpx1",
        "content": "As of last school year, McCutcheon Hall became male only, as a new girls only dorm was built, Meredith South. Yes the geography isn't the best for McCutcheon, but it is still close to Hillenbrand and Earhart in terms of dining halls. For days when you don't want to eat at the dining courts, there is a Dairy Queen, Subway, a Mexican place called Guac Box, and a chicken and fried rice place right across the street, but they do NOT take dining dollars or meal swipes. Over there is also a book store so you can rent/buy textbooks and other materials for classes with a walk across the street. McCutcheon as a dorm itself isn't the worst, it has AC, has a fairly nice lobby, a big activity room, a music room, an awesome lounge, a kitchenette, a study area, and some study rooms with curtains for some privacy. I'd highly recommend a bike or a skateboard/longboard for transportation since it is the furthest dorm from the academic part of campus. Overall, although McCutcheon isn't necessarily the best dorm, it isn't the worst either.",
        "replies": [
          {
            "id": "igtxy3t",
            "content": "what would you say is the best dorm?",
            "replies": [
              {
                "id": "igtycl7",
                "content": "I’d want to say any of the suite style dorms like the Parker Halls as they are at a great spot and have nice rooms",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "h67ukda",
        "content": "Just lived there this past year. I personally think it is one of the nicer dorms, that is, mostly good ACs, decent sized rooms, plus they have a computer lab and printer. Restaurants are literally next door. That being said, it is probably the furthest building from academic campus. A bike or a skateboard is pretty much a must-have, unless you plan on going to academic campus in the morning/afternoon and staying there the rest of the day.\n\nI'm pretty sure it's all male this year. Room size is pretty good, I'd say its pretty standard, not huge, but should be more than adequate space. Also comes with closets which is nice. You'll def meet some really cool people on your floor, in the lobbies etc .",
        "replies": [
          {
            "id": "igty5a7",
            "content": "&gt;A bike or a skateboard is pretty much a must-have, unless you plan on going to academic campus in the morning/afternoon and staying there the rest of the day.\n\nwhat about buses? is there only one bus?\n\nAlso, what bike would you recommend?",
            "replies": [
              {
                "id": "ijkwjjq",
                "content": "There are a couple of buses. I used to use silver loop and gold loop to get around campus a lot. I also used 4b and 23 pretty often. afaik those are the only free ones. If you download the MyCityBus app, it should give you more info.\n\nFor bikes, I got mine at Walmart for \\~130. Def not a bad investment, I use it a lot. You can also look at the surplus store. The first few weeks before and after BGR and first week of school, they're typically sold out everywhere. I bought mine a month into school.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "h690fdk",
        "content": "It’s all boys now and the location is pretty far from main campus, but closer to the airport if you have any classes there. Overall it was alright. If you have a room X01-X50 then you’re on what used to be the girl’s side with the better bathrooms.",
        "replies": []
      }
    ]
  },
  {
    "title": "Purdue laundry app",
    "selftext": "Hi I am a freshman in Mccutcheon hall.\nI just wonder that is there a laundry app for reservation or something.\nThank you",
    "id": "ibmcbb",
    "comments": [
      {
        "id": "g1woext",
        "content": "Unless it has changed in the past few years, the laundry machines use BoilerExpress. You can load money onto it online or at certain res hall front desks with cash. You swipe your student ID at the laundry to pay for the machines, but there are no reservations or anything.",
        "replies": [
          {
            "id": "g1wokfv",
            "content": "Thank you so much",
            "replies": [
              {
                "id": "g1wq57f",
                "content": "You can't reserve sadly, although they used to have a website that let you check the status of all the washers and dryers in the dorm's laundry room(s). I'm not sure if it's still up though, I can't find it. Hopefully it is because it was extremely helpful.",
                "replies": [
                  {
                    "id": "g1zrk27",
                    "content": "Think its still there although it looks weird now. I used it all the time until last semester. http://www.bcov77.com/p/washalertweb/washalertweb.aspx",
                    "replies": [
                      {
                        "id": "g1zxy0i",
                        "content": "Thank you so much!! The link I used to use was broken.",
                        "replies": []
                      }
                    ]
                  },
                  {
                    "id": "g1wqps5",
                    "content": "Yeah, it did used to be an app, but it’s not on the App Store anymore sadly. Whenever I used it though it was hardly ever accurate",
                    "replies": [
                      {
                        "id": "g1wvno3",
                        "content": "Oh really? That's sad. It was pretty accurate for my dorm. Saved me lots of time instead of going downstairs only to find that the laundry room is full.",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "g1ws7fb",
        "content": "There used to be something called Purdue Wash Alert that would tell you the availability of machines, but as someone else already commented, I can’t seem to find it anymore even though I used it just last year.  Maybe keep an eye out for it as the semester starts.",
        "replies": []
      },
      {
        "id": "g1wqsup",
        "content": "There’s some website where u can see which washers and dryers are available and u can sign up to be emailed when a running one is finished.",
        "replies": []
      }
    ]
  },
  {
    "title": "Practice Rooms?",
    "selftext": "I’m a freshman going to Philharmonic Orchestra. My dorm is McCutcheon Hall, but because of the housing crisis, the music room has been turned into housing. Does anyone know a place (preferably near McCutcheon where I could practice? Not sure if I’m allowed to play in my room due to noise.",
    "id": "p77k63",
    "comments": [
      {
        "id": "h9ihkrj",
        "content": "You could always ask your RA if you can practice in your room. I occasionally did that but I just used a practice mute and tried to practice at a reasonable time.",
        "replies": []
      },
      {
        "id": "h9ix4lr",
        "content": "Hilly B has one as well",
        "replies": []
      },
      {
        "id": "h9jmar6",
        "content": "I believe many students in phil keep their instruments in the music hall a lot of the time, and practice there",
        "replies": []
      },
      {
        "id": "h9htmml",
        "content": "I know shreve has one",
        "replies": []
      },
      {
        "id": "h9k39tf",
        "content": "What do you play? It honestly just depends. They have practice rooms in Elliot, but they are in the tower on the 4th and 5th floors. Also, I'm sure that after the first few weeks people will be moved out of the practice rooms.",
        "replies": [
          {
            "id": "h9k5j2h",
            "content": "I play clarinet.",
            "replies": []
          }
        ]
      },
      {
        "id": "h9lm0jk",
        "content": "Harrison (next door to McCutcheon) has one- I think. You’ll meet my kid- she’s a flute.",
        "replies": []
      }
    ]
  },
  {
    "title": "Mccutcheon Hall music room?",
    "selftext": "Is there a music room where there’s a piano? I know theres one piano in the lobby but I don’t wanna disturb others and practice my own. +What times are they available?",
    "id": "phl3wl",
    "comments": [
      {
        "id": "hbk4wqi",
        "content": "Normally there was a music room with a piano that sometimes people would bring an amp or a drumset into. It’s right next to the study room in the basement on the north side. This year it has been converted into a quad of freshman, same with the individual study rooms on the far ends. Hopefully it will be back next year.",
        "replies": [
          {
            "id": "hbmaad8",
            "content": "The far side study rooms with the curtain things are rooms now? How do people have space for stuff in there? XD",
            "replies": [
              {
                "id": "hbmfil3",
                "content": "Yeah seriously. Each of them is a single with a door on the outside to make it a triple. Some of the classrooms by the computer lab are barracks now",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "id": "hbjb9js",
        "content": "There should be one on the 1st floor. When I was there last year, you could use it pretty much whenever as long as you got the key from the front desk. Maybe don't play at night though lol",
        "replies": []
      },
      {
        "id": "hbmagj0",
        "content": "There should be ones in other dorms, idk if you can go there tho. I know there’s one in the basement of Hillenbrand and the door to go downstairs was usually unlocked until 5pm on weekdays",
        "replies": []
      }
    ]
  },
  {
    "title": "What's McCutcheon Hall like?",
    "selftext": "Looking at the LCs for CS and it's required to stay at McCutcheon for the Fall semester for this LC. What's the social life and everything like at McCutcheon? ",
    "id": "8b0vhf",
    "comments": [
      {
        "id": "dx31qxu",
        "content": "McCutcheon is great in many ways (and not in a few). The rooms themselves are really nice and pretty spacious and the bathrooms have recently been updated so are very clean. Also the general areas are nice and new and theres a computer lab which is great for printing. It's all freshman so it becomes a good community (although it will depend on your RA and floor). \n\nHowever, it is far from campus-the farthest. But in my opinion its pretty similar to Harrison, Hillenbrand, and even Earhart (once you get to these your pretty much back). And you can always take the bus. And the other big negative is there's no food in it but it is really close to Hillenbrand and Earhart. \n\nAll in all, I had a great year there and would recommend it to any freshman. ",
        "replies": [
          {
            "id": "hy1nela",
            "content": "Stupid question but how many elevators are in McCutcheon? I got a room on the 8th floor for next year and Ive heard McCutcheon is just like Owen/Tark/Wiley but just copy pasted another 4 floors and Owen only has one elevator. I tried looking up a floor plan but google was useless.",
            "replies": []
          }
        ]
      },
      {
        "id": "dx46wny",
        "content": "First of all, it's not all freshmen, just mostly freshman because upperclassmen usually don't choose to stay there after freshman year due to the distance (unless they're a Pro Flight major- it's close to the airport). So that leaves the most rooms of any dorm on campus open for freshmen when they are assigned housing. The CS LC is big this year, and takes up 2 floors. Each floor seems to be its own separate community, and most guys on one floor don't really know anyone on the other. But on each floor it's really nice to live with a bunch of other guys taking the same classes because they all help each other when needed. Most room doors are left open and people walk in and out of each others' rooms freely, hang out, game, get/give homework help, whatever. People do form smaller, closer friend groups over time as they get to know each other better, but everyone gets along. There are a couple guys who just stay in their rooms and don't socialize at all, but it's definitely not because they haven't been invited to many times. I mean, it's CS. It's more surprising there aren't more like that. A lot of the LC guys are moving to the same dorm next year and rooming together-  not necessarily with the same person they roomed with this year, though. Overall, not really any negatives with the LC unless you don't want to live with only people in your same major. The only real negative with McCutcheon is the distance, which you get used to. 10/10 would recommend.",
        "replies": []
      },
      {
        "id": "dx5a880",
        "content": "I have nothing to add about the actual environment in McCutcheon because I live in Shreve, however distance is not as big of a factor as I feared it would be, and I suspect I would get used to it just as well as I did in Shreve. Sloop is always around at the Earhart stop to get you to class, the connector will take you to Wabash Landing and beyond, and you really do benefit from having the parking garage right next door. Street parking seems to be much harder to come across this semester as opposed to last semester, so if that’s something you need, McFucking Far Away is your dorm lol. I actually ranked Cary, Owen, Tark, and Wiley higher than Shreve last year and thank god I didn’t get stuck there, I had no idea how hot it was going to be in the fall and even in the winter (I think my heater is broken or the maintenance guy is the same one who works on PHYSICS, because fuck is that building hot upstairs).",
        "replies": []
      },
      {
        "id": "dx64vnj",
        "content": "We lit over here. Also there is a Krannert LC (little known fact) along with CS, CNIT.\n\nHonestly, it’s a nice dorm and there’s always guys gaming out in the common room so if you like anime then this is your place.  ;)",
        "replies": []
      }
    ]
  }
]
